[NoCoverage] StringLiteral
src/config/connectDB.js:3:49
 const { Sequelize } = require('sequelize');
 
-const sequelize = new Sequelize('tour_booking', 'root', null, {
+const sequelize = new Sequelize('tour_booking', "", null, {
     host: 'localhost',
     dialect: 'mysql'

[NoCoverage] BlockStatement
src/config/connectDB.js:8:32
     dialect: 'mysql'
 });
 
-const connection = async () => {
-    try {
-        await sequelize.authenticate();
-        console.log('Connection has been established successfully.');
-    } catch (error) {
-        console.log('Unable to connect to the database:', error);
-    }
-}
+const connection = async () => {}
 
 export default connection;

[NoCoverage] BlockStatement
src/config/connectDB.js:9:9
 });
 
 const connection = async () => {
-    try {
-        await sequelize.authenticate();
-        console.log('Connection has been established successfully.');
-    } catch (error) {
+    try {} catch (error) {
         console.log('Unable to connect to the database:', error);
     }

[NoCoverage] StringLiteral
src/config/connectDB.js:11:21
 const connection = async () => {
     try {
         await sequelize.authenticate();
-        console.log('Connection has been established successfully.');
+        console.log("");
     } catch (error) {
         console.log('Unable to connect to the database:', error);

[NoCoverage] BlockStatement
src/config/connectDB.js:12:21
     try {
         await sequelize.authenticate();
         console.log('Connection has been established successfully.');
-    } catch (error) {
-        console.log('Unable to connect to the database:', error);
-    }
+    } catch (error) {}
 }
 
