[NoCoverage] BlockStatement
src/config/cors.js:3:29
 require("dotenv").config();
 
-const configCors = (app) => {
-    // Add headers before the routes are defined
-    app.use(function (req, res, next) {
-
-        // Website you wish to allow to connect
-        res.setHeader('Access-Control-Allow-Origin', process.env.REACT_URL);
-
-        // Request methods you wish to allow
-        res.setHeader('Access-Control-Allow-Methods', 'GET, POST, OPTIONS, PUT, PATCH, DELETE');
-
-        // Request headers you wish to allow
-        res.setHeader('Access-Control-Allow-Headers', 'X-Requested-With,content-type');
-
-        // Set to true if you need the website to include cookies in the requests sent
-        // to the API (e.g. in case you use sessions)
-        res.setHeader('Access-Control-Allow-Credentials', true);
-
-        // Pass to next layer of middleware
-        next();
-    });
-}
+const configCors = (app) => {}
 
 export default configCors;

[NoCoverage] BlockStatement
src/config/cors.js:5:39
 
 const configCors = (app) => {
     // Add headers before the routes are defined
-    app.use(function (req, res, next) {
-
-        // Website you wish to allow to connect
-        res.setHeader('Access-Control-Allow-Origin', process.env.REACT_URL);
-
-        // Request methods you wish to allow
-        res.setHeader('Access-Control-Allow-Methods', 'GET, POST, OPTIONS, PUT, PATCH, DELETE');
-
-        // Request headers you wish to allow
-        res.setHeader('Access-Control-Allow-Headers', 'X-Requested-With,content-type');
-
-        // Set to true if you need the website to include cookies in the requests sent
-        // to the API (e.g. in case you use sessions)
-        res.setHeader('Access-Control-Allow-Credentials', true);
-
-        // Pass to next layer of middleware
-        next();
-    });
+    app.use(function (req, res, next) {});
 }
 

[NoCoverage] StringLiteral
src/config/cors.js:8:23
     app.use(function (req, res, next) {
 
         // Website you wish to allow to connect
-        res.setHeader('Access-Control-Allow-Origin', process.env.REACT_URL);
+        res.setHeader("", process.env.REACT_URL);
 
         // Request methods you wish to allow

[NoCoverage] BooleanLiteral
src/config/cors.js:18:59
 
         // Set to true if you need the website to include cookies in the requests sent
         // to the API (e.g. in case you use sessions)
-        res.setHeader('Access-Control-Allow-Credentials', true);
+        res.setHeader('Access-Control-Allow-Credentials', false);
 
         // Pass to next layer of middleware
