[NoCoverage] BlockStatement
src/config/viewEngine.js:7:35
  * 
  * @param {*} app - express app
  */
-const configViewEngine = (app) => {
-    app.use(express.static('./src/public'));
-    app.set("view engine", "ejs");
-    app.set("views", "./src/views");
-}
+const configViewEngine = (app) => {}
 
 export default configViewEngine;

[NoCoverage] StringLiteral
src/config/viewEngine.js:8:28
  * @param {*} app - express app
  */
 const configViewEngine = (app) => {
-    app.use(express.static('./src/public'));
+    app.use(express.static(""));
     app.set("view engine", "ejs");
     app.set("views", "./src/views");

[NoCoverage] StringLiteral
src/config/viewEngine.js:10:13
 const configViewEngine = (app) => {
     app.use(express.static('./src/public'));
     app.set("view engine", "ejs");
-    app.set("views", "./src/views");
+    app.set("", "./src/views");
 }
 
