[NoCoverage] BlockStatement
src/controller/bookingController.js:2:43
 import bookingApiService from '../services/bookingApiService';
-const createBooking = async (req, res) => {
-    try {
-        console.log(">>> controller create booking called");
-        const data = await bookingApiService.createBooking(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createBooking = async (req, res) => {}
 const readBookingPagination = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/bookingController.js:3:9
 import bookingApiService from '../services/bookingApiService';
 const createBooking = async (req, res) => {
-    try {
-        console.log(">>> controller create booking called");
-        const data = await bookingApiService.createBooking(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/bookingController.js:4:21
 import bookingApiService from '../services/bookingApiService';
 const createBooking = async (req, res) => {
     try {
-        console.log(">>> controller create booking called");
+        console.log("");
         const data = await bookingApiService.createBooking(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/bookingController.js:11:21
             EC: data.EC,
             DT: data.DT,
         })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
+    } catch (error) {}
 }
 const readBookingPagination = async (req, res) => {

[NoCoverage] StringLiteral
src/controller/bookingController.js:14:17
     } catch (error) {
         return res.status(500).json({
             EM: 'error from server',
-            EC: '1',
+            EC: "",
             DT: '',
         })

[NoCoverage] BlockStatement
src/controller/bookingController.js:19:51
         })
     }
 }
-const readBookingPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await bookingApiService.getBookingWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readBookingPagination = async (req, res) => {}
 const readBookingById = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/bookingController.js:20:9
     }
 }
 const readBookingPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await bookingApiService.getBookingWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/bookingController.js:21:48
 }
 const readBookingPagination = async (req, res) => {
     try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await bookingApiService.getBookingWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.page && req.query.limit) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] ConditionalExpression
src/controller/bookingController.js:21:13
 }
 const readBookingPagination = async (req, res) => {
     try {
-        if (req.query.page && req.query.limit) {
+        if (false) {
             let page = req.query.page;
             let limit = req.query.limit;

[NoCoverage] UnaryOperator
src/controller/bookingController.js:24:80
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await bookingApiService.getBookingWithPagination(+page, +limit);
+            let data = await bookingApiService.getBookingWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/bookingController.js:24:73
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await bookingApiService.getBookingWithPagination(+page, +limit);
+            let data = await bookingApiService.getBookingWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] ObjectLiteral
src/controller/bookingController.js:25:41
             let page = req.query.page;
             let limit = req.query.limit;
             let data = await bookingApiService.getBookingWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
+            return res.status(200).json({})
         }
     } catch (error) {

[NoCoverage] BlockStatement
src/controller/bookingController.js:31:21
                 DT: data.DT,
             })
         }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
+    } catch (error) {}
 }
 const readBookingById = async (req, res) => {

[NoCoverage] StringLiteral
src/controller/bookingController.js:35:17
         return res.status(500).json({
             EM: 'error from server',
             EC: '1',
-            DT: '',
+            DT: "Stryker was here!",
         })
     }

[NoCoverage] BlockStatement
src/controller/bookingController.js:39:45
         })
     }
 }
-const readBookingById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await bookingApiService.getBookingById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readBookingById = async (req, res) => {}
 const updateBooking = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/bookingController.js:40:9
     }
 }
 const readBookingById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await bookingApiService.getBookingById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ConditionalExpression
src/controller/bookingController.js:41:13
 }
 const readBookingById = async (req, res) => {
     try {
-        if (req.query.id) {
+        if (false) {
             let data = await bookingApiService.getBookingById(+req.query.id);
             return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/bookingController.js:41:27
 }
 const readBookingById = async (req, res) => {
     try {
-        if (req.query.id) {
-            let data = await bookingApiService.getBookingById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.id) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] UnaryOperator
src/controller/bookingController.js:42:63
 const readBookingById = async (req, res) => {
     try {
         if (req.query.id) {
-            let data = await bookingApiService.getBookingById(+req.query.id);
+            let data = await bookingApiService.getBookingById(-req.query.id);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/bookingController.js:57:43
         })
     }
 }
-const updateBooking = async (req, res) => {
-    try {
-        console.log("update in booking controller called")
-        let data = await bookingApiService.updateBooking(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updateBooking = async (req, res) => {}
 const deleteBooking = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/bookingController.js:58:9
     }
 }
 const updateBooking = async (req, res) => {
-    try {
-        console.log("update in booking controller called")
-        let data = await bookingApiService.updateBooking(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/bookingController.js:61:37
     try {
         console.log("update in booking controller called")
         let data = await bookingApiService.updateBooking(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
+        return res.status(200).json({})
     } catch (error) {
         return res.status(500).json({

[NoCoverage] ObjectLiteral
src/controller/bookingController.js:67:37
             DT: data.DT,
         })
     } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
+        return res.status(500).json({})
     }
 }

[NoCoverage] BlockStatement
src/controller/bookingController.js:74:43
         })
     }
 }
-const deleteBooking = async (req, res) => {
-    try {
-        let data = await bookingApiService.deleteBooking(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deleteBooking = async (req, res) => {}
 module.exports = {
     createBooking, readBookingPagination, updateBooking, deleteBooking, readBookingById

[NoCoverage] BlockStatement
src/controller/bookingController.js:75:9
     }
 }
 const deleteBooking = async (req, res) => {
-    try {
-        let data = await bookingApiService.deleteBooking(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/bookingController.js:77:37
 const deleteBooking = async (req, res) => {
     try {
         let data = await bookingApiService.deleteBooking(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
+        return res.status(200).json({})
     } catch (error) {
         return res.status(500).json({

[NoCoverage] StringLiteral
src/controller/bookingController.js:84:17
         })
     } catch (error) {
         return res.status(500).json({
-            EM: 'error from server',
+            EM: "",
             EC: '1',
             DT: '',
