[NoCoverage] BlockStatement
src/controller/customerController.js:2:44
 import customerApiService from '../services/customerApiService';
-const createCustomer = async (req, res) => {
-    try {
-        console.log(">>> controller create customer called");
-        const data = await customerApiService.createCustomer(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createCustomer = async (req, res) => {}
 const readCustomerPagination = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/customerController.js:3:9
 import customerApiService from '../services/customerApiService';
 const createCustomer = async (req, res) => {
-    try {
-        console.log(">>> controller create customer called");
-        const data = await customerApiService.createCustomer(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/customerController.js:4:21
 import customerApiService from '../services/customerApiService';
 const createCustomer = async (req, res) => {
     try {
-        console.log(">>> controller create customer called");
+        console.log("");
         const data = await customerApiService.createCustomer(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/customerController.js:19:52
         })
     }
 }
-const readCustomerPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await customerApiService.getCustomerWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readCustomerPagination = async (req, res) => {}
 const readCustomerById = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/customerController.js:20:9
     }
 }
 const readCustomerPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await customerApiService.getCustomerWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] LogicalOperator
src/controller/customerController.js:21:13
 }
 const readCustomerPagination = async (req, res) => {
     try {
-        if (req.query.page && req.query.limit) {
+        if (req.query.page || req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;

[NoCoverage] UnaryOperator
src/controller/customerController.js:24:75
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await customerApiService.getCustomerWithPagination(+page, +limit);
+            let data = await customerApiService.getCustomerWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/customerController.js:24:82
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await customerApiService.getCustomerWithPagination(+page, +limit);
+            let data = await customerApiService.getCustomerWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/customerController.js:39:46
         })
     }
 }
-const readCustomerById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await customerApiService.getCustomerById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readCustomerById = async (req, res) => {}
 const updateCustomer = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/customerController.js:40:9
     }
 }
 const readCustomerById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await customerApiService.getCustomerById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/customerController.js:41:27
 }
 const readCustomerById = async (req, res) => {
     try {
-        if (req.query.id) {
-            let data = await customerApiService.getCustomerById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.id) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] UnaryOperator
src/controller/customerController.js:42:65
 const readCustomerById = async (req, res) => {
     try {
         if (req.query.id) {
-            let data = await customerApiService.getCustomerById(+req.query.id);
+            let data = await customerApiService.getCustomerById(-req.query.id);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/customerController.js:57:44
         })
     }
 }
-const updateCustomer = async (req, res) => {
-    try {
-        console.log("update in customer controller called")
-        let data = await customerApiService.updateCustomer(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updateCustomer = async (req, res) => {}
 const deleteCustomer = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/customerController.js:58:9
     }
 }
 const updateCustomer = async (req, res) => {
-    try {
-        console.log("update in customer controller called")
-        let data = await customerApiService.updateCustomer(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/customerController.js:74:44
         })
     }
 }
-const deleteCustomer = async (req, res) => {
-    try {
-        let data = await customerApiService.deleteCustomer(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deleteCustomer = async (req, res) => {}
 module.exports = {
     createCustomer, readCustomerPagination, updateCustomer, deleteCustomer, readCustomerById

[NoCoverage] BlockStatement
src/controller/customerController.js:75:9
     }
 }
 const deleteCustomer = async (req, res) => {
-    try {
-        let data = await customerApiService.deleteCustomer(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',
