[NoCoverage] BlockStatement
src/controller/dashboardController.js:2:47
 import dashboardService from '../services/dashboardService';
-const fetchTourPlanning = async (req, res) => {
-    try {
-        let data = await dashboardService.getTourPlanning();
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const fetchTourPlanning = async (req, res) => {}
 module.exports = {
     fetchTourPlanning

[NoCoverage] BlockStatement
src/controller/dashboardController.js:3:9
 import dashboardService from '../services/dashboardService';
 const fetchTourPlanning = async (req, res) => {
-    try {
-        let data = await dashboardService.getTourPlanning();
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/dashboardController.js:18:18
         })
     }
 }
-module.exports = {
-    fetchTourPlanning
-}
+module.exports = {}
