[NoCoverage] BlockStatement
src/controller/discountController.js:2:44
 import discountApiService from '../services/discountApiService';
-const createDiscount = async (req, res) => {
-    try {
-        console.log(">>> controller create discount called");
-        const data = await discountApiService.createDiscount(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createDiscount = async (req, res) => {}
 const readDiscountPagination = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/discountController.js:3:9
 import discountApiService from '../services/discountApiService';
 const createDiscount = async (req, res) => {
-    try {
-        console.log(">>> controller create discount called");
-        const data = await discountApiService.createDiscount(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/discountController.js:4:21
 import discountApiService from '../services/discountApiService';
 const createDiscount = async (req, res) => {
     try {
-        console.log(">>> controller create discount called");
+        console.log("");
         const data = await discountApiService.createDiscount(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/discountController.js:19:52
         })
     }
 }
-const readDiscountPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await discountApiService.getDiscountWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readDiscountPagination = async (req, res) => {}
 const readDiscountById = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/discountController.js:20:9
     }
 }
 const readDiscountPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await discountApiService.getDiscountWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] UnaryOperator
src/controller/discountController.js:24:82
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await discountApiService.getDiscountWithPagination(+page, +limit);
+            let data = await discountApiService.getDiscountWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/discountController.js:24:75
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await discountApiService.getDiscountWithPagination(+page, +limit);
+            let data = await discountApiService.getDiscountWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/discountController.js:39:46
         })
     }
 }
-const readDiscountById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await discountApiService.getDiscountById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readDiscountById = async (req, res) => {}
 const updateDiscount = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/discountController.js:40:9
     }
 }
 const readDiscountById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await discountApiService.getDiscountById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ConditionalExpression
src/controller/discountController.js:41:13
 }
 const readDiscountById = async (req, res) => {
     try {
-        if (req.query.id) {
+        if (true) {
             let data = await discountApiService.getDiscountById(+req.query.id);
             return res.status(200).json({

[NoCoverage] UnaryOperator
src/controller/discountController.js:42:65
 const readDiscountById = async (req, res) => {
     try {
         if (req.query.id) {
-            let data = await discountApiService.getDiscountById(+req.query.id);
+            let data = await discountApiService.getDiscountById(-req.query.id);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/discountController.js:57:44
         })
     }
 }
-const updateDiscount = async (req, res) => {
-    try {
-        console.log("update in discount controller called")
-        let data = await discountApiService.updateDiscount(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updateDiscount = async (req, res) => {}
 const deleteDiscount = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/discountController.js:58:9
     }
 }
 const updateDiscount = async (req, res) => {
-    try {
-        console.log("update in discount controller called")
-        let data = await discountApiService.updateDiscount(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/discountController.js:59:21
 }
 const updateDiscount = async (req, res) => {
     try {
-        console.log("update in discount controller called")
+        console.log("")
         let data = await discountApiService.updateDiscount(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/discountController.js:74:44
         })
     }
 }
-const deleteDiscount = async (req, res) => {
-    try {
-        let data = await discountApiService.deleteDiscount(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deleteDiscount = async (req, res) => {}
 module.exports = {
     createDiscount, readDiscountPagination, updateDiscount, deleteDiscount, readDiscountById

[NoCoverage] BlockStatement
src/controller/discountController.js:75:9
     }
 }
 const deleteDiscount = async (req, res) => {
-    try {
-        let data = await discountApiService.deleteDiscount(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',
