[NoCoverage] BlockStatement
src/controller/homeController.js:1:44
-const handleHomePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'home.ejs' });
-}
+const handleHomePage = async (req, res) => {}
 const handleTravelPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'travel.ejs' });

[NoCoverage] StringLiteral
src/controller/homeController.js:2:23
 const handleHomePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'home.ejs' });
+    return res.render("", { content: 'home.ejs' });
 }
 const handleTravelPage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/homeController.js:4:46
 const handleHomePage = async (req, res) => {
     return res.render("layout.ejs", { content: 'home.ejs' });
 }
-const handleTravelPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'travel.ejs' });
-}
+const handleTravelPage = async (req, res) => {}
 const handleTourPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'tour.ejs' });

[NoCoverage] BlockStatement
src/controller/homeController.js:7:44
 const handleTravelPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'travel.ejs' });
 }
-const handleTourPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'tour.ejs' });
-}
+const handleTourPage = async (req, res) => {}
 // const handlePackagePage = async (req, res) => {
 //     let page = 1;

[NoCoverage] StringLiteral
src/controller/homeController.js:8:48
     return res.render("layout.ejs", { content: 'travel.ejs' });
 }
 const handleTourPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'tour.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 // const handlePackagePage = async (req, res) => {

[NoCoverage] ObjectLiteral
src/controller/homeController.js:8:37
     return res.render("layout.ejs", { content: 'travel.ejs' });
 }
 const handleTourPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'tour.ejs' });
+    return res.render("layout.ejs", {});
 }
 // const handlePackagePage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/homeController.js:22:48
 //     let totalNumber = await packageService.getTotalNumber();
 //     return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
 // }
-const handleDiscountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'discount.ejs' });
-}
+const handleDiscountPage = async (req, res) => {}
 const handleAccountPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'account.ejs' });

[NoCoverage] StringLiteral
src/controller/homeController.js:23:48
 //     return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
 // }
 const handleDiscountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'discount.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 const handleAccountPage = async (req, res) => {

[NoCoverage] StringLiteral
src/controller/homeController.js:23:23
 //     return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
 // }
 const handleDiscountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'discount.ejs' });
+    return res.render("", { content: 'discount.ejs' });
 }
 const handleAccountPage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/homeController.js:25:47
 const handleDiscountPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'discount.ejs' });
 }
-const handleAccountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'account.ejs' });
-}
+const handleAccountPage = async (req, res) => {}
 const handleBookingPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'booking.ejs' });

[NoCoverage] ObjectLiteral
src/controller/homeController.js:26:37
     return res.render("layout.ejs", { content: 'discount.ejs' });
 }
 const handleAccountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'account.ejs' });
+    return res.render("layout.ejs", {});
 }
 const handleBookingPage = async (req, res) => {

[NoCoverage] StringLiteral
src/controller/homeController.js:26:23
     return res.render("layout.ejs", { content: 'discount.ejs' });
 }
 const handleAccountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'account.ejs' });
+    return res.render("", { content: 'account.ejs' });
 }
 const handleBookingPage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/homeController.js:28:47
 const handleAccountPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'account.ejs' });
 }
-const handleBookingPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'booking.ejs' });
-}
+const handleBookingPage = async (req, res) => {}
 const handleInvoicePage = async (req, res) => {
     return res.render("layout.ejs", { content: 'invoice.ejs' });

[NoCoverage] BlockStatement
src/controller/homeController.js:31:47
 const handleBookingPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'booking.ejs' });
 }
-const handleInvoicePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'invoice.ejs' });
-}
+const handleInvoicePage = async (req, res) => {}
 const handleCustomerPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'customer.ejs' });

[NoCoverage] ObjectLiteral
src/controller/homeController.js:32:37
     return res.render("layout.ejs", { content: 'booking.ejs' });
 }
 const handleInvoicePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'invoice.ejs' });
+    return res.render("layout.ejs", {});
 }
 const handleCustomerPage = async (req, res) => {

[NoCoverage] StringLiteral
src/controller/homeController.js:32:48
     return res.render("layout.ejs", { content: 'booking.ejs' });
 }
 const handleInvoicePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'invoice.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 const handleCustomerPage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/homeController.js:34:48
 const handleInvoicePage = async (req, res) => {
     return res.render("layout.ejs", { content: 'invoice.ejs' });
 }
-const handleCustomerPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'customer.ejs' });
-}
+const handleCustomerPage = async (req, res) => {}
 const handleStatisticsPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'statistics.ejs' });

[NoCoverage] BlockStatement
src/controller/homeController.js:37:50
 const handleCustomerPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'customer.ejs' });
 }
-const handleStatisticsPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'statistics.ejs' });
-}
+const handleStatisticsPage = async (req, res) => {}
 module.exports = {
     handleHomePage, handleTravelPage, handleTourPage, handleDiscountPage, handleAccountPage, handleBookingPage, handleInvoicePage, handleCustomerPage, handleStatisticsPage

[NoCoverage] ObjectLiteral
src/controller/homeController.js:38:37
     return res.render("layout.ejs", { content: 'customer.ejs' });
 }
 const handleStatisticsPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'statistics.ejs' });
+    return res.render("layout.ejs", {});
 }
 module.exports = {
