[NoCoverage] BlockStatement
src/controller/loginController.js:2:48
 import loginService from '../services/loginService';
-const handleCompanyLogin = async (req, res) => {
-    try {
-        let data = await loginService.handleCompanyLogin(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT
-        });
-    } catch (error) {
-        console.log("Error handleCompanyLogin Controller", error);
-    }
-}
+const handleCompanyLogin = async (req, res) => {}
 
 module.exports = { handleCompanyLogin }

[NoCoverage] BlockStatement
src/controller/loginController.js:3:9
 import loginService from '../services/loginService';
 const handleCompanyLogin = async (req, res) => {
-    try {
-        let data = await loginService.handleCompanyLogin(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.log("Error handleCompanyLogin Controller", error);
     }

[NoCoverage] ObjectLiteral
src/controller/loginController.js:5:37
 const handleCompanyLogin = async (req, res) => {
     try {
         let data = await loginService.handleCompanyLogin(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.log("Error handleCompanyLogin Controller", error);

[NoCoverage] BlockStatement
src/controller/loginController.js:10:21
             EC: data.EC,
             DT: data.DT
         });
-    } catch (error) {
-        console.log("Error handleCompanyLogin Controller", error);
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/controller/loginController.js:11:21
             DT: data.DT
         });
     } catch (error) {
-        console.log("Error handleCompanyLogin Controller", error);
+        console.log("", error);
     }
 }
