[NoCoverage] BlockStatement
src/controller/packageController.js:3:51
 import packageApiService from "../services/packageApiService";
 
-const readPackagePagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-
-            let data = await packageApiService.getPackageWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readPackagePagination = async (req, res) => {}
 const readPackageByAddressList = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/packageController.js:4:9
 import packageApiService from "../services/packageApiService";
 
 const readPackagePagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-
-            let data = await packageApiService.getPackageWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ConditionalExpression
src/controller/packageController.js:5:13
 
 const readPackagePagination = async (req, res) => {
     try {
-        if (req.query.page && req.query.limit) {
+        if (true) {
             let page = req.query.page;
             let limit = req.query.limit;

[NoCoverage] UnaryOperator
src/controller/packageController.js:9:80
             let page = req.query.page;
             let limit = req.query.limit;
 
-            let data = await packageApiService.getPackageWithPagination(+page, +limit);
+            let data = await packageApiService.getPackageWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/packageController.js:9:73
             let page = req.query.page;
             let limit = req.query.limit;
 
-            let data = await packageApiService.getPackageWithPagination(+page, +limit);
+            let data = await packageApiService.getPackageWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] ObjectLiteral
src/controller/packageController.js:10:41
             let limit = req.query.limit;
 
             let data = await packageApiService.getPackageWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
+            return res.status(200).json({})
         }
     } catch (error) {

[NoCoverage] BlockStatement
src/controller/packageController.js:24:54
         })
     }
 }
-const readPackageByAddressList = async (req, res) => {
-    try {
-        const decodedAddressList = decodeURIComponent(req.query.addressList);
-        let data = await packageApiService.getPackageByAddressList(decodedAddressList);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readPackageByAddressList = async (req, res) => {}
 const readPackageById = async (req, res) => {
 

[NoCoverage] BlockStatement
src/controller/packageController.js:25:9
     }
 }
 const readPackageByAddressList = async (req, res) => {
-    try {
-        const decodedAddressList = decodeURIComponent(req.query.addressList);
-        let data = await packageApiService.getPackageByAddressList(decodedAddressList);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/packageController.js:28:37
     try {
         const decodedAddressList = decodeURIComponent(req.query.addressList);
         let data = await packageApiService.getPackageByAddressList(decodedAddressList);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
+        return res.status(200).json({})
     } catch (error) {
         return res.status(500).json({

[NoCoverage] BlockStatement
src/controller/packageController.js:44:43
 const readPackageById = async (req, res) => {
 
 }
-const createPackage = async (req, res) => {
-    try {
-        let data = await packageApiService.createPackage(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createPackage = async (req, res) => {}
 const updatePackage = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/packageController.js:45:9
 
 }
 const createPackage = async (req, res) => {
-    try {
-        let data = await packageApiService.createPackage(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/packageController.js:47:37
 const createPackage = async (req, res) => {
     try {
         let data = await packageApiService.createPackage(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
+        return res.status(200).json({})
     } catch (error) {
         return res.status(500).json({

[NoCoverage] BlockStatement
src/controller/packageController.js:60:43
         })
     }
 }
-const updatePackage = async (req, res) => {
-    try {
-        console.log(">>> update req body", req.body);
-        let data = await packageApiService.updatePackage(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updatePackage = async (req, res) => {}
 
 const deletePackage = async (req, res) => {

[NoCoverage] BlockStatement
src/controller/packageController.js:61:9
     }
 }
 const updatePackage = async (req, res) => {
-    try {
-        console.log(">>> update req body", req.body);
-        let data = await packageApiService.updatePackage(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/packageController.js:62:21
 }
 const updatePackage = async (req, res) => {
     try {
-        console.log(">>> update req body", req.body);
+        console.log("", req.body);
         let data = await packageApiService.updatePackage(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/packageController.js:78:43
     }
 }
 
-const deletePackage = async (req, res) => {
-    try {
-        let data = await packageApiService.deletePackage(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deletePackage = async (req, res) => {}
 module.exports = {
     readPackagePagination, readPackageById, readPackageByAddressList, createPackage, deletePackage, updatePackage

[NoCoverage] BlockStatement
src/controller/packageController.js:79:9
 }
 
 const deletePackage = async (req, res) => {
-    try {
-        let data = await packageApiService.deletePackage(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/packageController.js:81:37
 const deletePackage = async (req, res) => {
     try {
         let data = await packageApiService.deletePackage(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
+        return res.status(200).json({})
     } catch (error) {
         return res.status(500).json({
