[NoCoverage] BlockStatement
src/controller/tourController.js:2:40
 import tourApiService from '../services/tourApiService';
-const createTour = async (req, res) => {
-    try {
-        const data = await tourApiService.createTour(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createTour = async (req, res) => {}
 const readTourPagination = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/tourController.js:3:9
 import tourApiService from '../services/tourApiService';
 const createTour = async (req, res) => {
-    try {
-        const data = await tourApiService.createTour(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/tourController.js:18:48
         })
     }
 }
-const readTourPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-
-            let data = await tourApiService.getTourWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readTourPagination = async (req, res) => {}
 const readTourById = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/tourController.js:19:9
     }
 }
 const readTourPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-
-            let data = await tourApiService.getTourWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] UnaryOperator
src/controller/tourController.js:24:74
             let page = req.query.page;
             let limit = req.query.limit;
 
-            let data = await tourApiService.getTourWithPagination(+page, +limit);
+            let data = await tourApiService.getTourWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/tourController.js:24:67
             let page = req.query.page;
             let limit = req.query.limit;
 
-            let data = await tourApiService.getTourWithPagination(+page, +limit);
+            let data = await tourApiService.getTourWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/tourController.js:39:42
         })
     }
 }
-const readTourById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await tourApiService.getTourById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readTourById = async (req, res) => {}
 const updateTour = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/tourController.js:40:9
     }
 }
 const readTourById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await tourApiService.getTourById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/tourController.js:41:27
 }
 const readTourById = async (req, res) => {
     try {
-        if (req.query.id) {
-            let data = await tourApiService.getTourById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.id) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] UnaryOperator
src/controller/tourController.js:42:57
 const readTourById = async (req, res) => {
     try {
         if (req.query.id) {
-            let data = await tourApiService.getTourById(+req.query.id);
+            let data = await tourApiService.getTourById(-req.query.id);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/tourController.js:57:40
         })
     }
 }
-const updateTour = async (req, res) => {
-    try {
-        console.log("update in tour controller called")
-        let data = await tourApiService.updateTour(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updateTour = async (req, res) => {}
 const deleteTour = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/tourController.js:58:9
     }
 }
 const updateTour = async (req, res) => {
-    try {
-        console.log("update in tour controller called")
-        let data = await tourApiService.updateTour(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] StringLiteral
src/controller/tourController.js:59:21
 }
 const updateTour = async (req, res) => {
     try {
-        console.log("update in tour controller called")
+        console.log("")
         let data = await tourApiService.updateTour(req.body);
         return res.status(200).json({

[NoCoverage] BlockStatement
src/controller/tourController.js:74:40
         })
     }
 }
-const deleteTour = async (req, res) => {
-    try {
-        let data = await tourApiService.deleteTour(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deleteTour = async (req, res) => {}
 module.exports = {
     createTour, readTourPagination, updateTour, deleteTour, readTourById

[NoCoverage] BlockStatement
src/controller/tourController.js:75:9
     }
 }
 const deleteTour = async (req, res) => {
-    try {
-        let data = await tourApiService.deleteTour(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',
