[NoCoverage] BlockStatement
src/controller/travelController.js:2:42
 import travelApiService from '../services/travelApiService';
-const createTravel = async (req, res) => {
-    try {
-        console.log(">>> controller create travel called");
-        const data = await travelApiService.createTravel(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const createTravel = async (req, res) => {}
 const readTravelPagination = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/travelController.js:3:9
 import travelApiService from '../services/travelApiService';
 const createTravel = async (req, res) => {
-    try {
-        console.log(">>> controller create travel called");
-        const data = await travelApiService.createTravel(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/travelController.js:19:50
         })
     }
 }
-const readTravelPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await travelApiService.getTravelWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readTravelPagination = async (req, res) => {}
 const readTravelById = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/travelController.js:20:9
     }
 }
 const readTravelPagination = async (req, res) => {
-    try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await travelApiService.getTravelWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/travelController.js:21:48
 }
 const readTravelPagination = async (req, res) => {
     try {
-        if (req.query.page && req.query.limit) {
-            let page = req.query.page;
-            let limit = req.query.limit;
-            let data = await travelApiService.getTravelWithPagination(+page, +limit);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.page && req.query.limit) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] UnaryOperator
src/controller/travelController.js:24:71
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await travelApiService.getTravelWithPagination(+page, +limit);
+            let data = await travelApiService.getTravelWithPagination(-page, +limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] UnaryOperator
src/controller/travelController.js:24:78
         if (req.query.page && req.query.limit) {
             let page = req.query.page;
             let limit = req.query.limit;
-            let data = await travelApiService.getTravelWithPagination(+page, +limit);
+            let data = await travelApiService.getTravelWithPagination(+page, -limit);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] BlockStatement
src/controller/travelController.js:39:44
         })
     }
 }
-const readTravelById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await travelApiService.getTravelById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const readTravelById = async (req, res) => {}
 const updateTravel = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/travelController.js:40:9
     }
 }
 const readTravelById = async (req, res) => {
-    try {
-        if (req.query.id) {
-            let data = await travelApiService.getTravelById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/travelController.js:41:27
 }
 const readTravelById = async (req, res) => {
     try {
-        if (req.query.id) {
-            let data = await travelApiService.getTravelById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
-        }
+        if (req.query.id) {}
     } catch (error) {
         return res.status(500).json({

[NoCoverage] UnaryOperator
src/controller/travelController.js:42:61
 const readTravelById = async (req, res) => {
     try {
         if (req.query.id) {
-            let data = await travelApiService.getTravelById(+req.query.id);
+            let data = await travelApiService.getTravelById(-req.query.id);
             return res.status(200).json({
                 EM: data.EM,

[NoCoverage] ObjectLiteral
src/controller/travelController.js:43:41
     try {
         if (req.query.id) {
             let data = await travelApiService.getTravelById(+req.query.id);
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data.DT,
-            })
+            return res.status(200).json({})
         }
     } catch (error) {

[NoCoverage] BlockStatement
src/controller/travelController.js:57:42
         })
     }
 }
-const updateTravel = async (req, res) => {
-    try {
-        console.log("update in travel controller called")
-        let data = await travelApiService.updateTravel(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const updateTravel = async (req, res) => {}
 const deleteTravel = async (req, res) => {
     try {

[NoCoverage] BlockStatement
src/controller/travelController.js:58:9
     }
 }
 const updateTravel = async (req, res) => {
-    try {
-        console.log("update in travel controller called")
-        let data = await travelApiService.updateTravel(req.body);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] BlockStatement
src/controller/travelController.js:74:42
         })
     }
 }
-const deleteTravel = async (req, res) => {
-    try {
-        let data = await travelApiService.deleteTravel(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
-        return res.status(500).json({
-            EM: 'error from server',
-            EC: '1',
-            DT: '',
-        })
-    }
-}
+const deleteTravel = async (req, res) => {}
 module.exports = {
     createTravel, readTravelPagination, updateTravel, deleteTravel, readTravelById

[NoCoverage] BlockStatement
src/controller/travelController.js:75:9
     }
 }
 const deleteTravel = async (req, res) => {
-    try {
-        let data = await travelApiService.deleteTravel(req.body.id);
-        return res.status(200).json({
-            EM: data.EM,
-            EC: data.EC,
-            DT: data.DT,
-        })
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({
             EM: 'error from server',

[NoCoverage] ObjectLiteral
src/controller/travelController.js:90:18
         })
     }
 }
-module.exports = {
-    createTravel, readTravelPagination, updateTravel, deleteTravel, readTravelById
-}
+module.exports = {}
