[NoCoverage] BlockStatement
src/middleware/JWTActions.js:3:32
 require('dotenv').config();
 import jwt from 'jsonwebtoken';
-const createJWT = (payload) => {
-    let key = process.env.JWT_SECRET;
-    try {
-        let token = jwt.sign(payload, key);
-        console.log(token);
-        return token;
-    } catch (error) {
-        return null;
-    }
-}
+const createJWT = (payload) => {}
 const verifyToken = (token) => {
     try {

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:5:9
 import jwt from 'jsonwebtoken';
 const createJWT = (payload) => {
     let key = process.env.JWT_SECRET;
-    try {
-        let token = jwt.sign(payload, key);
-        console.log(token);
-        return token;
-    } catch (error) {
+    try {} catch (error) {
         return null;
     }

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:9:21
         let token = jwt.sign(payload, key);
         console.log(token);
         return token;
-    } catch (error) {
-        return null;
-    }
+    } catch (error) {}
 }
 const verifyToken = (token) => {

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:13:32
         return null;
     }
 }
-const verifyToken = (token) => {
-    try {
-        let key = process.env.JWT_SECRET;
-        let data = null;
-        jwt.verify(token, key, function (error, decoded) {
-            if (error) {
-                console.log(error);
-                return data;
-            }
-            console.log(decoded);
-            return decoded;
-        })
-    } catch (error) {
-        return null;
-    }
-}
+const verifyToken = (token) => {}
 module.exports = {
     createJWT, verifyToken

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:14:9
     }
 }
 const verifyToken = (token) => {
-    try {
-        let key = process.env.JWT_SECRET;
-        let data = null;
-        jwt.verify(token, key, function (error, decoded) {
-            if (error) {
-                console.log(error);
-                return data;
-            }
-            console.log(decoded);
-            return decoded;
-        })
-    } catch (error) {
+    try {} catch (error) {
         return null;
     }

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:17:58
     try {
         let key = process.env.JWT_SECRET;
         let data = null;
-        jwt.verify(token, key, function (error, decoded) {
-            if (error) {
-                console.log(error);
-                return data;
-            }
-            console.log(decoded);
-            return decoded;
-        })
+        jwt.verify(token, key, function (error, decoded) {})
     } catch (error) {
         return null;

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:18:24
         let key = process.env.JWT_SECRET;
         let data = null;
         jwt.verify(token, key, function (error, decoded) {
-            if (error) {
-                console.log(error);
-                return data;
-            }
+            if (error) {}
             console.log(decoded);
             return decoded;

[NoCoverage] ConditionalExpression
src/middleware/JWTActions.js:18:17
         let key = process.env.JWT_SECRET;
         let data = null;
         jwt.verify(token, key, function (error, decoded) {
-            if (error) {
+            if (false) {
                 console.log(error);
                 return data;

[NoCoverage] BlockStatement
src/middleware/JWTActions.js:25:21
             console.log(decoded);
             return decoded;
         })
-    } catch (error) {
-        return null;
-    }
+    } catch (error) {}
 }
 module.exports = {
