[NoCoverage] StringLiteral
src/routes/api.js:19:17
  */
 
 const initApiRoutes = (app) => {
-    router.post("/package/create", packageController.createPackage);
+    router.post("", packageController.createPackage);
     router.get("/package/read-by-address", packageController.readPackageByAddressList);
     router.get("/package/read", packageController.readPackagePagination);

[NoCoverage] StringLiteral
src/routes/api.js:21:16
 const initApiRoutes = (app) => {
     router.post("/package/create", packageController.createPackage);
     router.get("/package/read-by-address", packageController.readPackageByAddressList);
-    router.get("/package/read", packageController.readPackagePagination);
+    router.get("", packageController.readPackagePagination);
     router.put("/package/update", packageController.updatePackage);
     router.delete("/package/delete", packageController.deletePackage);

[NoCoverage] StringLiteral
src/routes/api.js:25:17
     router.put("/package/update", packageController.updatePackage);
     router.delete("/package/delete", packageController.deletePackage);
 
-    router.post("/tour/create", tourController.createTour);
+    router.post("", tourController.createTour);
     router.get("/tour/read", tourController.readTourPagination);
     router.get("/tour/read-by-id", tourController.readTourById);

[NoCoverage] StringLiteral
src/routes/api.js:32:16
     router.delete("/tour/delete", tourController.deleteTour);
 
     router.get("/travel/read", travelController.readTravelPagination);
-    router.get("/travel/read-by-id", travelController.readTravelById);
+    router.get("", travelController.readTravelById);
     router.post("/travel/create", travelController.createTravel);
     router.put("/travel/update", travelController.updateTravel);

[NoCoverage] StringLiteral
src/routes/api.js:37:16
     router.put("/travel/update", travelController.updateTravel);
     router.delete("/travel/delete", travelController.deleteTravel);
 
-    router.get("/customer/read", customerController.readCustomerPagination);
+    router.get("", customerController.readCustomerPagination);
     router.get("/customer/read-by-id", customerController.readCustomerById);
     router.post("/customer/create", customerController.createCustomer);

[NoCoverage] StringLiteral
src/routes/api.js:38:16
     router.delete("/travel/delete", travelController.deleteTravel);
 
     router.get("/customer/read", customerController.readCustomerPagination);
-    router.get("/customer/read-by-id", customerController.readCustomerById);
+    router.get("", customerController.readCustomerById);
     router.post("/customer/create", customerController.createCustomer);
     router.put("/customer/update", customerController.updateCustomer);

[NoCoverage] StringLiteral
src/routes/api.js:39:17
 
     router.get("/customer/read", customerController.readCustomerPagination);
     router.get("/customer/read-by-id", customerController.readCustomerById);
-    router.post("/customer/create", customerController.createCustomer);
+    router.post("", customerController.createCustomer);
     router.put("/customer/update", customerController.updateCustomer);
     router.delete("/customer/delete", customerController.deleteCustomer);

[NoCoverage] StringLiteral
src/routes/api.js:44:16
     router.delete("/customer/delete", customerController.deleteCustomer);
 
     router.get("/booking/read", bookingController.readBookingPagination);
-    router.get("/booking/read-by-id", bookingController.readBookingById);
+    router.get("", bookingController.readBookingById);
     router.post("/booking/create", bookingController.createBooking);
     router.put("/booking/update", bookingController.updateBooking);

[NoCoverage] StringLiteral
src/routes/api.js:45:17
 
     router.get("/booking/read", bookingController.readBookingPagination);
     router.get("/booking/read-by-id", bookingController.readBookingById);
-    router.post("/booking/create", bookingController.createBooking);
+    router.post("", bookingController.createBooking);
     router.put("/booking/update", bookingController.updateBooking);
     router.delete("/booking/delete", bookingController.deleteBooking);

[NoCoverage] StringLiteral
src/routes/api.js:52:16
     router.get("/discount/read", discountController.readDiscountPagination);
     router.get("/discount/read-by-id", discountController.readDiscountById);
     router.post("/discount/create", discountController.createDiscount);
-    router.put("/discount/update", discountController.updateDiscount);
+    router.put("", discountController.updateDiscount);
     router.delete("/discount/delete", discountController.deleteDiscount);
 

[NoCoverage] StringLiteral
src/routes/api.js:53:19
     router.get("/discount/read-by-id", discountController.readDiscountById);
     router.post("/discount/create", discountController.createDiscount);
     router.put("/discount/update", discountController.updateDiscount);
-    router.delete("/discount/delete", discountController.deleteDiscount);
+    router.delete("", discountController.deleteDiscount);
 
     router.get("/tourpackage/read", tourPackageController.readAllTourPackage);
