[NoCoverage] BlockStatement
src/routes/web.js:11:32
  * @param {*} app : express app
  */
 
-const initWebRoutes = (app) => {
-    router.get("/", homeController.handleHomePage);
-    router.get("/travel", homeController.handleTravelPage);
-    router.get("/tour", homeController.handleTourPage);
-    // router.get("/package", homeController.handlePackagePage);
-    router.get("/discount", homeController.handleDiscountPage);
-    router.get("/account", homeController.handleAccountPage);
-    router.get("/booking", homeController.handleBookingPage);
-    router.get("/invoice", homeController.handleInvoicePage);
-    router.get("/customer", homeController.handleCustomerPage);
-    router.get("/statistics", homeController.handleStatisticsPage);
-    // router.post("/package/create-package", packageController.handleCreatePackage);
-    return app.use("/", router);
-}
+const initWebRoutes = (app) => {}
 
 export default initWebRoutes;

[NoCoverage] StringLiteral
src/routes/web.js:16:16
     router.get("/travel", homeController.handleTravelPage);
     router.get("/tour", homeController.handleTourPage);
     // router.get("/package", homeController.handlePackagePage);
-    router.get("/discount", homeController.handleDiscountPage);
+    router.get("", homeController.handleDiscountPage);
     router.get("/account", homeController.handleAccountPage);
     router.get("/booking", homeController.handleBookingPage);

[NoCoverage] StringLiteral
src/routes/web.js:18:16
     // router.get("/package", homeController.handlePackagePage);
     router.get("/discount", homeController.handleDiscountPage);
     router.get("/account", homeController.handleAccountPage);
-    router.get("/booking", homeController.handleBookingPage);
+    router.get("", homeController.handleBookingPage);
     router.get("/invoice", homeController.handleInvoicePage);
     router.get("/customer", homeController.handleCustomerPage);

[NoCoverage] StringLiteral
src/routes/web.js:23:20
     router.get("/customer", homeController.handleCustomerPage);
     router.get("/statistics", homeController.handleStatisticsPage);
     // router.post("/package/create-package", packageController.handleCreatePackage);
-    return app.use("/", router);
+    return app.use("", router);
 }
 
