[NoCoverage] ConditionalExpression
src/server.js:11:5
 require("dotenv").config();
 const cors = require('cors');
 
-if (typeof window !== 'undefined') {
+if (true) {
     const { v4: uuidv4 } = require('uuid');
     window.uuid = { v4: uuidv4 };

[NoCoverage] ConditionalExpression
src/server.js:11:5
 require("dotenv").config();
 const cors = require('cors');
 
-if (typeof window !== 'undefined') {
+if (false) {
     const { v4: uuidv4 } = require('uuid');
     window.uuid = { v4: uuidv4 };

[NoCoverage] ArrayDeclaration
src/server.js:21:24
 // configCors(app);
 
 // Bổ sung các origin muốn cho phép truy cập
-const allowedOrigins = [process.env.REACT_URL, process.env.CUSTOMER_URL];
+const allowedOrigins = [];
 
 const corsOptions = {

[NoCoverage] BlockStatement
src/server.js:24:41
 const allowedOrigins = [process.env.REACT_URL, process.env.CUSTOMER_URL];
 
 const corsOptions = {
-    origin: function (origin, callback) {
-        // Cho phép truy cập nếu origin nằm trong danh sách allowedOrigins hoặc không có origin (cho những request không gửi từ trình duyệt, như XMLHttpRequest từ JavaScript).
-        if (!origin || allowedOrigins.includes(origin)) {
-            callback(null, true);
-        } else {
-            callback(new Error('Not allowed by CORS'));
-        }
-    },
+    origin: function (origin, callback) {},
     methods: 'GET, POST, OPTIONS, PUT, PATCH, DELETE',
     allowedHeaders: 'X-Requested-With,content-type',

[NoCoverage] ConditionalExpression
src/server.js:26:13
 const corsOptions = {
     origin: function (origin, callback) {
         // Cho phép truy cập nếu origin nằm trong danh sách allowedOrigins hoặc không có origin (cho những request không gửi từ trình duyệt, như XMLHttpRequest từ JavaScript).
-        if (!origin || allowedOrigins.includes(origin)) {
+        if (true) {
             callback(null, true);
         } else {

[NoCoverage] LogicalOperator
src/server.js:26:13
 const corsOptions = {
     origin: function (origin, callback) {
         // Cho phép truy cập nếu origin nằm trong danh sách allowedOrigins hoặc không có origin (cho những request không gửi từ trình duyệt, như XMLHttpRequest từ JavaScript).
-        if (!origin || allowedOrigins.includes(origin)) {
+        if (!origin && allowedOrigins.includes(origin)) {
             callback(null, true);
         } else {

[NoCoverage] BooleanLiteral
src/server.js:27:28
     origin: function (origin, callback) {
         // Cho phép truy cập nếu origin nằm trong danh sách allowedOrigins hoặc không có origin (cho những request không gửi từ trình duyệt, như XMLHttpRequest từ JavaScript).
         if (!origin || allowedOrigins.includes(origin)) {
-            callback(null, true);
+            callback(null, false);
         } else {
             callback(new Error('Not allowed by CORS'));

[NoCoverage] BlockStatement
src/server.js:28:16
         // Cho phép truy cập nếu origin nằm trong danh sách allowedOrigins hoặc không có origin (cho những request không gửi từ trình duyệt, như XMLHttpRequest từ JavaScript).
         if (!origin || allowedOrigins.includes(origin)) {
             callback(null, true);
-        } else {
-            callback(new Error('Not allowed by CORS'));
-        }
+        } else {}
     },
     methods: 'GET, POST, OPTIONS, PUT, PATCH, DELETE',

[NoCoverage] StringLiteral
src/server.js:33:21
         }
     },
     methods: 'GET, POST, OPTIONS, PUT, PATCH, DELETE',
-    allowedHeaders: 'X-Requested-With,content-type',
+    allowedHeaders: "",
     credentials: true,
 };

[NoCoverage] BooleanLiteral
src/server.js:34:18
     },
     methods: 'GET, POST, OPTIONS, PUT, PATCH, DELETE',
     allowedHeaders: 'X-Requested-With,content-type',
-    credentials: true,
+    credentials: false,
 };
 

[NoCoverage] BooleanLiteral
src/server.js:49:43
 connection();
 //config body-parser
 app.use(bodyParser.json());
-app.use(bodyParser.urlencoded({ extended: true }));
+app.use(bodyParser.urlencoded({ extended: false }));
 //init web routes
 initWebRoutes(app);

[NoCoverage] BlockStatement
src/server.js:56:24
 
 
 const PORT = 8080;
-app.listen(PORT, () => {
-    console.log(">>> Server is running at port ", PORT);
-})
+app.listen(PORT, () => {})
 
 export default app;
