[Killed] BlockStatement
src/services/bookingApiService.js:12:28
                 customerGmail: bookingData.customer.customerGmail,
             }
         })
-        if (existCustomer) {
-            await db.Customers.update({
-                customerPhone: bookingData.customer.customerPhone,
-                customerName: bookingData.customer.customerName
-            }, {
-                where: {
-                    id: existCustomer.id
-                }
-            })
-            createdBooking = await db.Bookings.create({
-                exportInvoice: bookingData.exportInvoice,
-                bookingStatus: bookingData.bookingStatus,
-                bookingPrice: bookingData.bookingPrice,
-                paymentNote: bookingData.paymentNote,
-                paymentImage: bookingData.paymentImage,
-                travelId: bookingData.travelId,
-                customerId: existCustomer.id
-            });
-            for (let i = 0; i < bookingData.touristList.length; i++) {
-                await db.Tourists.create({
-                    touristName: bookingData.touristList[i],
-                    bookingId: createdBooking.id
-                })
-            }
-        }
+        if (existCustomer) {}
         else {
             const createdCustomer = await db.Customers.create({
killedBy: Booking API Service createBooking should update an existing customer and create a booking successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1}, "EC": "0", "EM": "create booking successfully"}
Received:
  {"DT": {}, "EC": "0", "EM": "create booking successfully"}

Message:

[Killed] ConditionalExpression
src/services/bookingApiService.js:12:13
                 customerGmail: bookingData.customer.customerGmail,
             }
         })
-        if (existCustomer) {
+        if (false) {
             await db.Customers.update({
                 customerPhone: bookingData.customer.customerPhone,
killedBy: Booking API Service createBooking should update an existing customer and create a booking successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1}, "EC": "0", "EM": "create booking successfully"}
Received:
  {"DT": {}, "EC": "0", "EM": "create booking successfully"}

Message:

[Survived] ObjectLiteral
src/services/bookingApiService.js:16:16
             await db.Customers.update({
                 customerPhone: bookingData.customer.customerPhone,
                 customerName: bookingData.customer.customerName
-            }, {
-                where: {
-                    id: existCustomer.id
-                }
-            })
+            }, {})
             createdBooking = await db.Bookings.create({
                 exportInvoice: bookingData.exportInvoice,

[Timeout] UpdateOperator
src/services/bookingApiService.js:30:65
                 travelId: bookingData.travelId,
                 customerId: existCustomer.id
             });
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i < bookingData.touristList.length; i--) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],

[Survived] EqualityOperator
src/services/bookingApiService.js:30:29
                 travelId: bookingData.travelId,
                 customerId: existCustomer.id
             });
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i >= bookingData.touristList.length; i++) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],

[NoCoverage] BlockStatement
src/services/bookingApiService.js:37:14
                 })
             }
         }
-        else {
-            const createdCustomer = await db.Customers.create({
-                customerName: bookingData.customer.customerName,
-                customerPhone: bookingData.customer.customerPhone,
-                customerGmail: bookingData.customer.customerGmail
-            });
-            const createdBooking = await db.Bookings.create({
-                bookingStatus: bookingData.bookingStatus,
-                bookingPrice: bookingData.bookingPrice,
-                paymentNote: bookingData.paymentNote,
-                paymentImage: bookingData.paymentImage,
-                travelId: bookingData.travelId,
-                customerId: createdCustomer.id
-            })
-            for (let i = 0; i < bookingData.touristList.length; i++) {
-                await db.Tourists.create({
-                    touristName: bookingData.touristList[i],
-                    bookingId: createdBooking.id
-                })
-            }
-        }
+        else {}
         return {
             EM: 'create booking successfully',

[NoCoverage] ObjectLiteral
src/services/bookingApiService.js:43:61
                 customerPhone: bookingData.customer.customerPhone,
                 customerGmail: bookingData.customer.customerGmail
             });
-            const createdBooking = await db.Bookings.create({
-                bookingStatus: bookingData.bookingStatus,
-                bookingPrice: bookingData.bookingPrice,
-                paymentNote: bookingData.paymentNote,
-                paymentImage: bookingData.paymentImage,
-                travelId: bookingData.travelId,
-                customerId: createdCustomer.id
-            })
+            const createdBooking = await db.Bookings.create({})
             for (let i = 0; i < bookingData.touristList.length; i++) {
                 await db.Tourists.create({

[NoCoverage] EqualityOperator
src/services/bookingApiService.js:51:29
                 travelId: bookingData.travelId,
                 customerId: createdCustomer.id
             })
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i <= bookingData.touristList.length; i++) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],

[NoCoverage] EqualityOperator
src/services/bookingApiService.js:51:29
                 travelId: bookingData.travelId,
                 customerId: createdCustomer.id
             })
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i >= bookingData.touristList.length; i++) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],

[Killed] StringLiteral
src/services/bookingApiService.js:60:17
         }
         return {
             EM: 'create booking successfully',
-            EC: '0',
+            EC: "",
             DT: createdBooking
         }
killedBy: Booking API Service createBooking should update an existing customer and create a booking successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1}, "EC": "0", "EM": "create booking successfully"}
Received:
  {"DT": {"id": 1}, "EC": "", "EM": "create booking successfully"}

Message:

[Killed] ArrayDeclaration
src/services/bookingApiService.js:72:22
             where: {
                 id: bookingId
             },
-            include: [
-                {
-                    model: db.Customers,
-                },
-                {
-                    model: db.Tourists
-                },
-                {
-                    model: db.Travels,
-                    include: [
-                        {
-                            model: db.Tours
-                        },
-                        {
-                            model: db.Discounts
-                        }
-                    ]
-                }
-            ]
+            include: []
         });
         return {
killedBy: Booking API Service getBookingById should get booking data by ID successfully
statusReason: Expected value   undefined
Received:
  [Function findOne]

Message:
  expected findOne to have been called exactly once with exact arguments {
  where: { id: 8 },
  include: [

[Killed] ObjectLiteral
src/services/bookingApiService.js:73:17
                 id: bookingId
             },
             include: [
-                {
-                    model: db.Customers,
-                },
+                {},
                 {
                     model: db.Tourists
killedBy: Booking API Service getBookingById should get booking data by ID successfully
statusReason: Expected value   undefined
Received:
  [Function findOne]

Message:
  expected findOne to have been called exactly once with exact arguments {
  where: { id: 8 },
  include: [

[Killed] ObjectLiteral
src/services/bookingApiService.js:92:16
                 }
             ]
         });
-        return {
-            EM: 'get booking by id successfully',
-            EC: '0',
-            DT: booking
-        }
+        return {}
     } catch (error) {
     }
killedBy: Booking API Service getBookingById should get booking data by ID successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  {}

Message:

[Killed] BlockStatement
src/services/bookingApiService.js:101:34
     }
 }
 const getBookingWithPagination = async (page, limit) => {
-    if (page == 0 && limit == 0) {
-        let data = await db.Bookings.findAll({
-            include: [
-                {
-                    model: db.Customers
-                },
-                {
-                    model: db.Travels,
-                }
-            ]
-        });
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: data,
-        }
-    }
+    if (page == 0 && limit == 0) {}
     else if (page >= 1 && limit >= 1) {
         let offset = (page - 1) * limit;
killedBy: Booking API Service getBookingWithPagination should get all data successfully when page and limit are 0
statusReason: TypeError: Cannot read properties of undefined (reading 'EM')

[Killed] ConditionalExpression
src/services/bookingApiService.js:101:9
     }
 }
 const getBookingWithPagination = async (page, limit) => {
-    if (page == 0 && limit == 0) {
+    if (true) {
         let data = await db.Bookings.findAll({
             include: [
killedBy: Booking API Service getBookingWithPagination should get paginated data successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  10
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/bookingApiService.js:118:39
             DT: data,
         }
     }
-    else if (page >= 1 && limit >= 1) {
-        let offset = (page - 1) * limit;
-        const { count, rows } = await db.Bookings.findAndCountAll({
-            offset: offset,
-            limit: limit,
-            order: [["id", "DESC"]],
-            include: [{
-                model: db.Customers
-            }]
-        });
-        let totalPages = Math.ceil(count / limit);
-        let data = {
-            totalRows: count,
-            totalPages: totalPages,
-            bookings: rows,
-        }
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: data,
-        }
-    }
+    else if (page >= 1 && limit >= 1) {}
     else {
         return {
killedBy: Booking API Service getBookingWithPagination should get paginated data successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'EM')

[Killed] EqualityOperator
src/services/bookingApiService.js:118:14
             DT: data,
         }
     }
-    else if (page >= 1 && limit >= 1) {
+    else if (page < 1 && limit >= 1) {
         let offset = (page - 1) * limit;
         const { count, rows } = await db.Bookings.findAndCountAll({
killedBy: Booking API Service getBookingWithPagination should get paginated data successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "get data successfully"
Received:
  "error getting data"

Message:

[Survived] ArithmeticOperator
src/services/bookingApiService.js:119:22
         }
     }
     else if (page >= 1 && limit >= 1) {
-        let offset = (page - 1) * limit;
+        let offset = (page - 1) / limit;
         const { count, rows } = await db.Bookings.findAndCountAll({
             offset: offset,

[Survived] ArithmeticOperator
src/services/bookingApiService.js:119:23
         }
     }
     else if (page >= 1 && limit >= 1) {
-        let offset = (page - 1) * limit;
+        let offset = (page + 1) * limit;
         const { count, rows } = await db.Bookings.findAndCountAll({
             offset: offset,

[Survived] ArrayDeclaration
src/services/bookingApiService.js:123:21
         const { count, rows } = await db.Bookings.findAndCountAll({
             offset: offset,
             limit: limit,
-            order: [["id", "DESC"]],
+            order: [[]],
             include: [{
                 model: db.Customers

[Survived] ArrayDeclaration
src/services/bookingApiService.js:123:20
         const { count, rows } = await db.Bookings.findAndCountAll({
             offset: offset,
             limit: limit,
-            order: [["id", "DESC"]],
+            order: [],
             include: [{
                 model: db.Customers

[Survived] ArrayDeclaration
src/services/bookingApiService.js:124:22
             offset: offset,
             limit: limit,
             order: [["id", "DESC"]],
-            include: [{
-                model: db.Customers
-            }]
+            include: []
         });
         let totalPages = Math.ceil(count / limit);

[Killed] ArithmeticOperator
src/services/bookingApiService.js:128:36
                 model: db.Customers
             }]
         });
-        let totalPages = Math.ceil(count / limit);
+        let totalPages = Math.ceil(count * limit);
         let data = {
             totalRows: count,
killedBy: Booking API Service getBookingWithPagination should get paginated data successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  2
Received:
  50

Message:

[Killed] StringLiteral
src/services/bookingApiService.js:136:17
         }
         return {
             EM: 'get data successfully',
-            EC: '0',
+            EC: "",
             DT: data,
         }
killedBy: Booking API Service getBookingWithPagination should get paginated data successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "0"
Received:
  ""

Message:

[Killed] BlockStatement
src/services/bookingApiService.js:140:10
             DT: data,
         }
     }
-    else {
-        return {
-            EM: 'error getting data',
-            EC: '1',
-            DT: null,
-        }
-    }
+    else {}
 }
 const updateBooking = async (bookingData) => {
killedBy: Booking API Service getBookingWithPagination should handle invalid input parameters
statusReason: TypeError: Cannot read properties of undefined (reading 'EM')

[Killed] StringLiteral
src/services/bookingApiService.js:142:17
     }
     else {
         return {
-            EM: 'error getting data',
+            EM: "",
             EC: '1',
             DT: null,
killedBy: Booking API Service getBookingWithPagination should handle invalid input parameters
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "error getting data"
Received:
  ""

Message:

[Survived] BooleanLiteral
src/services/bookingApiService.js:153:43
         let data = await db.Bookings.findOne({
             where: { id: bookingData.id }
         })
-        if (bookingData.exportInvoice === true) {
+        if (bookingData.exportInvoice === false) {
             let touristNum = bookingData.touristList.length;
             let needUpdateTravel = await db.Travels.findOne({

[Survived] BlockStatement
src/services/bookingApiService.js:153:49
         let data = await db.Bookings.findOne({
             where: { id: bookingData.id }
         })
-        if (bookingData.exportInvoice === true) {
-            let touristNum = bookingData.touristList.length;
-            let needUpdateTravel = await db.Travels.findOne({
-                where: {
-                    id: bookingData.travelId
-                }
-            })
-            if (needUpdateTravel) {
-                let newRemain = needUpdateTravel.remainTicket - touristNum;
-                let res = await db.Travels.update({
-                    remainTicket: newRemain
-                }, {
-                    where: {
-                        id: bookingData.travelId
-                    }
-                })
-            }
-
-        }
+        if (bookingData.exportInvoice === true) {}
 
 

[Survived] ObjectLiteral
src/services/bookingApiService.js:156:24
         if (bookingData.exportInvoice === true) {
             let touristNum = bookingData.touristList.length;
             let needUpdateTravel = await db.Travels.findOne({
-                where: {
-                    id: bookingData.travelId
-                }
+                where: {}
             })
             if (needUpdateTravel) {

[Killed] ConditionalExpression
src/services/bookingApiService.js:160:17
                     id: bookingData.travelId
                 }
             })
-            if (needUpdateTravel) {
+            if (true) {
                 let newRemain = needUpdateTravel.remainTicket - touristNum;
                 let res = await db.Travels.update({
killedBy: Booking API Service updateBooking should update booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Survived] ConditionalExpression
src/services/bookingApiService.js:160:17
                     id: bookingData.travelId
                 }
             })
-            if (needUpdateTravel) {
+            if (false) {
                 let newRemain = needUpdateTravel.remainTicket - touristNum;
                 let res = await db.Travels.update({

[NoCoverage] ArithmeticOperator
src/services/bookingApiService.js:161:33
                 }
             })
             if (needUpdateTravel) {
-                let newRemain = needUpdateTravel.remainTicket - touristNum;
+                let newRemain = needUpdateTravel.remainTicket + touristNum;
                 let res = await db.Travels.update({
                     remainTicket: newRemain

[NoCoverage] ObjectLiteral
src/services/bookingApiService.js:165:28
                 let res = await db.Travels.update({
                     remainTicket: newRemain
                 }, {
-                    where: {
-                        id: bookingData.travelId
-                    }
+                    where: {}
                 })
             }

[Killed] ConditionalExpression
src/services/bookingApiService.js:174:13
         }
 
 
-        if (data) {
+        if (false) {
             await db.Tourists.destroy(
                 {
killedBy: Booking API Service updateBooking should update booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Survived] ConditionalExpression
src/services/bookingApiService.js:174:13
         }
 
 
-        if (data) {
+        if (true) {
             await db.Tourists.destroy(
                 {

[Survived] ObjectLiteral
src/services/bookingApiService.js:176:17
 
         if (data) {
             await db.Tourists.destroy(
-                {
-                    where: {
-                        bookingId: bookingData.id
-                    }
-                }
+                {}
             );
             for (let i = 0; i < bookingData.touristList.length; i++) {

[Killed] EqualityOperator
src/services/bookingApiService.js:182:29
                     }
                 }
             );
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i >= bookingData.touristList.length; i++) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],
killedBy: Booking API Service updateBooking should update booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] EqualityOperator
src/services/bookingApiService.js:182:29
                     }
                 }
             );
-            for (let i = 0; i < bookingData.touristList.length; i++) {
+            for (let i = 0; i <= bookingData.touristList.length; i++) {
                 await db.Tourists.create({
                     touristName: bookingData.touristList[i],
killedBy: Booking API Service updateBooking should update booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Survived] StringLiteral
src/services/bookingApiService.js:204:17
         }
 
         return {
-            EM: 'update booking successfully',
+            EM: "",
             EC: '0',
             DT: '',

[Survived] StringLiteral
src/services/bookingApiService.js:206:17
         return {
             EM: 'update booking successfully',
             EC: '0',
-            DT: '',
+            DT: "Stryker was here!",
         }
     } catch (error) {

[Killed] BlockStatement
src/services/bookingApiService.js:208:21
             EC: '0',
             DT: '',
         }
-    } catch (error) {
-        return {
-            EM: 'Error updating booking',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const deleteBooking = async (id) => {
killedBy: Booking API Service updateBooking should handle errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'EC')

[Killed] StringLiteral
src/services/bookingApiService.js:210:17
         }
     } catch (error) {
         return {
-            EM: 'Error updating booking',
+            EM: "",
             EC: '1',
             DT: '',
killedBy: Booking API Service updateBooking should handle errors gracefully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "Error updating booking"
Received:
  ""

Message:

[Killed] StringLiteral
src/services/bookingApiService.js:211:17
     } catch (error) {
         return {
             EM: 'Error updating booking',
-            EC: '1',
+            EC: "",
             DT: '',
         }
killedBy: Booking API Service updateBooking should handle errors gracefully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "1"
Received:
  ""

Message:

[Survived] ObjectLiteral
src/services/bookingApiService.js:218:51
 }
 const deleteBooking = async (id) => {
     try {
-        const booking = await db.Bookings.findOne({ where: { id: id } });
+        const booking = await db.Bookings.findOne({});
         if (booking) {
             // Delete BOOKING

[Killed] BlockStatement
src/services/bookingApiService.js:219:22
 const deleteBooking = async (id) => {
     try {
         const booking = await db.Bookings.findOne({ where: { id: id } });
-        if (booking) {
-            // Delete BOOKING
-            await db.Tourists.destroy({
-                where: {
-                    bookingId: booking.id
-                }
-            })
-            await db.Bookings.destroy({
-                where: { id: booking.id }
-            });
-
-            return {
-                EM: 'delete booking successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
+        if (booking) {} else {
             return {
                 EM: 'not found booking',
killedBy: Booking API Service deleteBooking should delete booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

Message:

[Killed] ConditionalExpression
src/services/bookingApiService.js:219:13
 const deleteBooking = async (id) => {
     try {
         const booking = await db.Bookings.findOne({ where: { id: id } });
-        if (booking) {
+        if (true) {
             // Delete BOOKING
             await db.Tourists.destroy({
killedBy: Booking API Service deleteBooking should handle not found booking
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "0"
Received:
  "1"

Message:

[Killed] StringLiteral
src/services/bookingApiService.js:231:21
             });
 
             return {
-                EM: 'delete booking successfully',
+                EM: "",
                 EC: '0',
                 DT: ''
killedBy: Booking API Service deleteBooking should delete booking successfully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "delete booking successfully"
Received:
  ""

Message:

[Survived] StringLiteral
src/services/bookingApiService.js:233:21
             return {
                 EM: 'delete booking successfully',
                 EC: '0',
-                DT: ''
+                DT: "Stryker was here!"
             };
         } else {

[Killed] BlockStatement
src/services/bookingApiService.js:235:16
                 EC: '0',
                 DT: ''
             };
-        } else {
-            return {
-                EM: 'not found booking',
-                EC: '0',
-                DT: ''
-            };
-        }
+        } else {}
     } catch (error) {
         return {
killedBy: Booking API Service deleteBooking should handle not found booking
statusReason: TypeError: Cannot read properties of undefined (reading 'EC')

[Killed] BlockStatement
src/services/bookingApiService.js:242:21
                 DT: ''
             };
         }
-    } catch (error) {
-        return {
-            EM: 'error deleting booking',
-            EC: '1',
-            DT: ''
-        };
-    }
+    } catch (error) {}
 };
 
killedBy: Booking API Service deleteBooking should handle errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'EC')

[Killed] ObjectLiteral
src/services/bookingApiService.js:243:16
             };
         }
     } catch (error) {
-        return {
-            EM: 'error deleting booking',
-            EC: '1',
-            DT: ''
-        };
+        return {};
     }
 };
killedBy: Booking API Service deleteBooking should handle errors gracefully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "1"
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/bookingApiService.js:245:17
     } catch (error) {
         return {
             EM: 'error deleting booking',
-            EC: '1',
+            EC: "",
             DT: ''
         };
killedBy: Booking API Service deleteBooking should handle errors gracefully
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  "1"
Received:
  ""

Message:
