[Killed] BlockStatement
src/services/discountApiService.js:2:48
 import db from "../models/index";
-const createDiscount = async (discountData) => {
-    try {
-        let data = await db.Discounts.create({
-            discountName: discountData.discountName,
-            discountType: discountData.discountType,
-            discountAmount: discountData.discountAmount,
-            discountDescription: discountData.discountDescription,
-        })
-        return {
-            EM: 'create discount successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
-        return {
-            EM: 'error creating discount',
-            EC: '1',
-            DT: undefined,
-        }
-    }
-}
+const createDiscount = async (discountData) => {}
 const getDiscountById = async (discountId) => {
     try {
killedBy: Discount API Service createDiscount should create a discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage"}, "EC": "0", "EM": "create discount successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/discountApiService.js:3:9
 import db from "../models/index";
 const createDiscount = async (discountData) => {
-    try {
-        let data = await db.Discounts.create({
-            discountName: discountData.discountName,
-            discountType: discountData.discountType,
-            discountAmount: discountData.discountAmount,
-            discountDescription: discountData.discountDescription,
-        })
-        return {
-            EM: 'create discount successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error creating discount',
killedBy: Discount API Service createDiscount should create a discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage"}, "EC": "0", "EM": "create discount successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/discountApiService.js:4:46
 import db from "../models/index";
 const createDiscount = async (discountData) => {
     try {
-        let data = await db.Discounts.create({
-            discountName: discountData.discountName,
-            discountType: discountData.discountType,
-            discountAmount: discountData.discountAmount,
-            discountDescription: discountData.discountDescription,
-        })
+        let data = await db.Discounts.create({})
         return {
             EM: 'create discount successfully',

[Killed] StringLiteral
src/services/discountApiService.js:12:17
         })
         return {
             EM: 'create discount successfully',
-            EC: '0',
+            EC: "",
             DT: data
         }
killedBy: Discount API Service createDiscount should create a discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage"}, "EC": "0", "EM": "create discount successfully"}
Received:
  {"DT": {"discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "d

[Killed] BlockStatement
src/services/discountApiService.js:15:21
             EC: '0',
             DT: data
         }
-    } catch (error) {
-        return {
-            EM: 'error creating discount',
-            EC: '1',
-            DT: undefined,
-        }
-    }
+    } catch (error) {}
 }
 const getDiscountById = async (discountId) => {
killedBy: Discount API Service createDiscount should handle errors during discount creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error creating discount"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/discountApiService.js:16:16
             DT: data
         }
     } catch (error) {
-        return {
-            EM: 'error creating discount',
-            EC: '1',
-            DT: undefined,
-        }
+        return {}
     }
 }
killedBy: Discount API Service createDiscount should handle errors during discount creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error creating discount"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/discountApiService.js:18:17
     } catch (error) {
         return {
             EM: 'error creating discount',
-            EC: '1',
+            EC: "",
             DT: undefined,
         }
killedBy: Discount API Service createDiscount should handle errors during discount creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error creating discount"}
Received:
  {"DT": undefined, "EC": "", "EM": "error creating discount"}

Message:

[Killed] BlockStatement
src/services/discountApiService.js:23:47
         }
     }
 }
-const getDiscountById = async (discountId) => {
-    try {
-        let discount = await db.Discounts.findOne({
-            where: {
-                id: discountId
-            },
-            include: {
-                model: db.Travels
-            }
-        });
-        return {
-            EM: 'get discount by id successfully',
-            EC: '0',
-            DT: discount
-        }
-    } catch (error) {
-        return {
-            EM: 'error getting discount by id',
-            EC: '1',
-            DT: undefined,
-        }
-    }
-}
+const getDiscountById = async (discountId) => {}
 const getDiscountWithPagination = async (page, limit) => {
     try {
killedBy: Discount API Service getDiscountById should get discount by ID successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"Travels": [{}], "discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage", "id": 1}, "EC": "0", "EM": "get discount by id successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/discountApiService.js:24:9
     }
 }
 const getDiscountById = async (discountId) => {
-    try {
-        let discount = await db.Discounts.findOne({
-            where: {
-                id: discountId
-            },
-            include: {
-                model: db.Travels
-            }
-        });
-        return {
-            EM: 'get discount by id successfully',
-            EC: '0',
-            DT: discount
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error getting discount by id',
killedBy: Discount API Service getDiscountById should get discount by ID successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"Travels": [{}], "discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage", "id": 1}, "EC": "0", "EM": "get discount by id successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/discountApiService.js:26:20
 const getDiscountById = async (discountId) => {
     try {
         let discount = await db.Discounts.findOne({
-            where: {
-                id: discountId
-            },
+            where: {},
             include: {
                 model: db.Travels

[Survived] ObjectLiteral
src/services/discountApiService.js:29:22
             where: {
                 id: discountId
             },
-            include: {
-                model: db.Travels
-            }
+            include: {}
         });
         return {

[Killed] ObjectLiteral
src/services/discountApiService.js:33:16
                 model: db.Travels
             }
         });
-        return {
-            EM: 'get discount by id successfully',
-            EC: '0',
-            DT: discount
-        }
+        return {}
     } catch (error) {
         return {
killedBy: Discount API Service getDiscountById should get discount by ID successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"Travels": [{}], "discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage", "id": 1}, "EC": "0", "EM": "get discount by id successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/discountApiService.js:35:17
         });
         return {
             EM: 'get discount by id successfully',
-            EC: '0',
+            EC: "",
             DT: discount
         }
killedBy: Discount API Service getDiscountById should get discount by ID successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"Travels": [{}], "discountAmount": 10, "discountDescription": "Test description", "discountName": "Test Discount", "discountType": "Percentage", "id": 1}, "EC": "0", "EM": "get discount by id successfully"}
Received:
  {"DT": {"Travels": [{}], "discountAmount": 10, "discountDescription": "Test des

[Killed] BlockStatement
src/services/discountApiService.js:38:21
             EC: '0',
             DT: discount
         }
-    } catch (error) {
-        return {
-            EM: 'error getting discount by id',
-            EC: '1',
-            DT: undefined,
-        }
-    }
+    } catch (error) {}
 }
 const getDiscountWithPagination = async (page, limit) => {
killedBy: Discount API Service getDiscountById should handle errors during reading discount data by ID
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting discount by id"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/discountApiService.js:39:16
             DT: discount
         }
     } catch (error) {
-        return {
-            EM: 'error getting discount by id',
-            EC: '1',
-            DT: undefined,
-        }
+        return {}
     }
 }
killedBy: Discount API Service getDiscountById should handle errors during reading discount data by ID
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting discount by id"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/discountApiService.js:40:17
         }
     } catch (error) {
         return {
-            EM: 'error getting discount by id',
+            EM: "",
             EC: '1',
             DT: undefined,
killedBy: Discount API Service getDiscountById should handle errors during reading discount data by ID
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting discount by id"}
Received:
  {"DT": undefined, "EC": "1", "EM": ""}

Message:

[Killed] EqualityOperator
src/services/discountApiService.js:48:26
 }
 const getDiscountWithPagination = async (page, limit) => {
     try {
-        if (page == 0 && limit == 0) {
+        if (page == 0 && limit != 0) {
             try {
                 let data = await db.Discounts.findAll({
killedBy: Discount API Service getDiscountWithPagination should get all discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "EC": "0", "EM": "get all discount successfully"}
Received:
  {"DT": {"discounts": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2",

[Killed] BlockStatement
src/services/discountApiService.js:48:38
 }
 const getDiscountWithPagination = async (page, limit) => {
     try {
-        if (page == 0 && limit == 0) {
-            try {
-                let data = await db.Discounts.findAll({
-                    include: [{
-                        model: db.Travels
-                    }]
-                });
-                return {
-                    EM: 'get all discount successfully',
-                    EC: '0',
-                    DT: data,
-                }
-            } catch (error) {
-                return {
-                    EM: 'error getting all discounts',
-                    EC: '1',
-                    DT: undefined,
-                }
-            }
-        }
+        if (page == 0 && limit == 0) {}
         else {
             try {
killedBy: Discount API Service getDiscountWithPagination should get all discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "EC": "0", "EM": "get all discount successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/discountApiService.js:49:17
 const getDiscountWithPagination = async (page, limit) => {
     try {
         if (page == 0 && limit == 0) {
-            try {
-                let data = await db.Discounts.findAll({
-                    include: [{
-                        model: db.Travels
-                    }]
-                });
-                return {
-                    EM: 'get all discount successfully',
-                    EC: '0',
-                    DT: data,
-                }
-            } catch (error) {
+            try {} catch (error) {
                 return {
                     EM: 'error getting all discounts',
killedBy: Discount API Service getDiscountWithPagination should get all discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "EC": "0", "EM": "get all discount successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/discountApiService.js:50:55
     try {
         if (page == 0 && limit == 0) {
             try {
-                let data = await db.Discounts.findAll({
-                    include: [{
-                        model: db.Travels
-                    }]
-                });
+                let data = await db.Discounts.findAll({});
                 return {
                     EM: 'get all discount successfully',

[Survived] ArrayDeclaration
src/services/discountApiService.js:51:30
         if (page == 0 && limit == 0) {
             try {
                 let data = await db.Discounts.findAll({
-                    include: [{
-                        model: db.Travels
-                    }]
+                    include: []
                 });
                 return {

[Killed] ObjectLiteral
src/services/discountApiService.js:55:24
                         model: db.Travels
                     }]
                 });
-                return {
-                    EM: 'get all discount successfully',
-                    EC: '0',
-                    DT: data,
-                }
+                return {}
             } catch (error) {
                 return {
killedBy: Discount API Service getDiscountWithPagination should get all discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "EC": "0", "EM": "get all discount successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/discountApiService.js:57:25
                 });
                 return {
                     EM: 'get all discount successfully',
-                    EC: '0',
+                    EC: "",
                     DT: data,
                 }
killedBy: Discount API Service getDiscountWithPagination should get all discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "EC": "0", "EM": "get all discount successfully"}
Received:
  {"DT": [{"Travels": [], "discountName": "Discount 1", "id": 1}, {"Travels": [], "discountName": "Discount 2", "id": 2}], "E

[Killed] BlockStatement
src/services/discountApiService.js:60:29
                     EC: '0',
                     DT: data,
                 }
-            } catch (error) {
-                return {
-                    EM: 'error getting all discounts',
-                    EC: '1',
-                    DT: undefined,
-                }
-            }
+            } catch (error) {}
         }
         else {
killedBy: Discount API Service getDiscountWithPagination should handle errors during discount retrieval
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting all discounts"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/discountApiService.js:69:17
             }
         }
         else {
-            try {
-                let offset = (page - 1) * limit;
-                const { count, rows } = await db.Discounts.findAndCountAll({
-                    offset: offset,
-                    limit: limit,
-                    order: [["id", "DESC"]],
-                    include: [{
-                        model: db.Travels
-                    }]
-                });
-                let totalPages = Math.ceil(count / limit);
-                let data = {
-                    totalRows: count,
-                    totalPages: totalPages,
-                    discounts: rows,
-                }
-                return {
-                    EM: 'get pagination discount successfully',
-                    EC: '0',
-                    DT: data,
-                }
-            } catch (error) {
+            try {} catch (error) {
                 return {
                     EM: 'error getting pagination discounts',
killedBy: Discount API Service getDiscountWithPagination should get paginated discounts successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discounts": [{"Travels": [], "discountName": "Discount 3", "id": 3}, {"Travels": [], "discountName": "Discount 4", "id": 4}], "totalPages": 2, "totalRows": 10}, "EC": "0", "EM": "get pagination discount successfully"}
Received:
  undefined

Message:

[Survived] ArithmeticOperator
src/services/discountApiService.js:70:31
         }
         else {
             try {
-                let offset = (page - 1) * limit;
+                let offset = (page + 1) * limit;
                 const { count, rows } = await db.Discounts.findAndCountAll({
                     offset: offset,

[Survived] ArithmeticOperator
src/services/discountApiService.js:70:30
         }
         else {
             try {
-                let offset = (page - 1) * limit;
+                let offset = (page - 1) / limit;
                 const { count, rows } = await db.Discounts.findAndCountAll({
                     offset: offset,

[Survived] ObjectLiteral
src/services/discountApiService.js:71:76
         else {
             try {
                 let offset = (page - 1) * limit;
-                const { count, rows } = await db.Discounts.findAndCountAll({
-                    offset: offset,
-                    limit: limit,
-                    order: [["id", "DESC"]],
-                    include: [{
-                        model: db.Travels
-                    }]
-                });
+                const { count, rows } = await db.Discounts.findAndCountAll({});
                 let totalPages = Math.ceil(count / limit);
                 let data = {

[Survived] StringLiteral
src/services/discountApiService.js:74:36
                 const { count, rows } = await db.Discounts.findAndCountAll({
                     offset: offset,
                     limit: limit,
-                    order: [["id", "DESC"]],
+                    order: [["id", ""]],
                     include: [{
                         model: db.Travels

[Killed] BlockStatement
src/services/discountApiService.js:90:29
                     EC: '0',
                     DT: data,
                 }
-            } catch (error) {
-                return {
-                    EM: 'error getting pagination discounts',
-                    EC: '1',
-                    DT: undefined,
-                }
-            }
+            } catch (error) {}
 
         }
killedBy: Discount API Service getDiscountWithPagination should handle errors during paginated discount retrieval
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting pagination discounts"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/discountApiService.js:91:24
                     DT: data,
                 }
             } catch (error) {
-                return {
-                    EM: 'error getting pagination discounts',
-                    EC: '1',
-                    DT: undefined,
-                }
+                return {}
             }
 
killedBy: Discount API Service getDiscountWithPagination should handle errors during paginated discount retrieval
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting pagination discounts"}
Received:
  {}

Message:

[Survived] ObjectLiteral
src/services/discountApiService.js:109:16
 }
 const updateDiscount = async (discountData) => {
     let data = await db.Discounts.findOne({
-        where: { id: discountData.id }
+        where: {}
     })
     if (data) {

[Killed] ConditionalExpression
src/services/discountApiService.js:111:9
     let data = await db.Discounts.findOne({
         where: { id: discountData.id }
     })
-    if (data) {
+    if (true) {
         await db.Discounts.update({
             discountName: discountData.discountName,
killedBy: Discount API Service updateDiscount should handle not found discount during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found discount"}
Received:
  {"DT": "", "EC": "0", "EM": "update discount successfully"}

Message:

[Killed] ConditionalExpression
src/services/discountApiService.js:111:9
     let data = await db.Discounts.findOne({
         where: { id: discountData.id }
     })
-    if (data) {
+    if (false) {
         await db.Discounts.update({
             discountName: discountData.discountName,
killedBy: Discount API Service updateDiscount should update discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update discount successfully"}
Received:
  {"DT": "", "EC": "0", "EM": "not found discount"}

Message:

[Killed] BlockStatement
src/services/discountApiService.js:123:10
             }
         })
     }
-    else {
-        return {
-            EM: 'not found discount',
-            EC: '0',
-            DT: '',
-        }
-    }
+    else {}
     return {
         EM: 'update discount successfully',
killedBy: Discount API Service updateDiscount should handle not found discount during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found discount"}
Received:
  {"DT": "", "EC": "0", "EM": "update discount successfully"}

Message:

[Killed] ObjectLiteral
src/services/discountApiService.js:130:12
             DT: '',
         }
     }
-    return {
-        EM: 'update discount successfully',
-        EC: '0',
-        DT: '',
-    }
+    return {}
 }
 const deleteDiscount = async (id) => {
killedBy: Discount API Service updateDiscount should update discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update discount successfully"}
Received:
  {}

Message:

[Killed] BlockStatement
src/services/discountApiService.js:137:9
     }
 }
 const deleteDiscount = async (id) => {
-    try {
-        const discount = await db.Discounts.findOne({ where: { id: id } });
-        if (discount) {
-            await db.Discounts.destroy({
-                where: { id: discount.id }
-            });
-            return {
-                EM: 'delete discount successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
-            return {
-                EM: 'not found discount',
-                EC: '0',
-                DT: ''
-            };
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error deleting discount',
killedBy: Discount API Service deleteDiscount should delete discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete discount successfully"}
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/discountApiService.js:139:13
 const deleteDiscount = async (id) => {
     try {
         const discount = await db.Discounts.findOne({ where: { id: id } });
-        if (discount) {
+        if (false) {
             await db.Discounts.destroy({
                 where: { id: discount.id }
killedBy: Discount API Service deleteDiscount should delete discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete discount successfully"}
Received:
  {"DT": "", "EC": "0", "EM": "not found discount"}

Message:

[Killed] ConditionalExpression
src/services/discountApiService.js:139:13
 const deleteDiscount = async (id) => {
     try {
         const discount = await db.Discounts.findOne({ where: { id: id } });
-        if (discount) {
+        if (true) {
             await db.Discounts.destroy({
                 where: { id: discount.id }
killedBy: Discount API Service deleteDiscount should handle not found discount during deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found discount"}
Received:
  {"DT": "", "EC": "1", "EM": "error deleting discount"}

Message:

[Survived] ObjectLiteral
src/services/discountApiService.js:140:40
     try {
         const discount = await db.Discounts.findOne({ where: { id: id } });
         if (discount) {
-            await db.Discounts.destroy({
-                where: { id: discount.id }
-            });
+            await db.Discounts.destroy({});
             return {
                 EM: 'delete discount successfully',

[Survived] ObjectLiteral
src/services/discountApiService.js:141:24
         const discount = await db.Discounts.findOne({ where: { id: id } });
         if (discount) {
             await db.Discounts.destroy({
-                where: { id: discount.id }
+                where: {}
             });
             return {

[Killed] ObjectLiteral
src/services/discountApiService.js:143:20
             await db.Discounts.destroy({
                 where: { id: discount.id }
             });
-            return {
-                EM: 'delete discount successfully',
-                EC: '0',
-                DT: ''
-            };
+            return {};
         } else {
             return {
killedBy: Discount API Service deleteDiscount should delete discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete discount successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/discountApiService.js:144:21
                 where: { id: discount.id }
             });
             return {
-                EM: 'delete discount successfully',
+                EM: "",
                 EC: '0',
                 DT: ''
killedBy: Discount API Service deleteDiscount should delete discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete discount successfully"}
Received:
  {"DT": "", "EC": "0", "EM": ""}

Message:
