[Killed] StringLiteral
src/services/discountApiService.js:145:21
             });
             return {
                 EM: 'delete discount successfully',
-                EC: '0',
+                EC: "",
                 DT: ''
             };
killedBy: Discount API Service deleteDiscount should delete discount successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete discount successfully"}
Received:
  {"DT": "", "EC": "", "EM": "delete discount successfully"}

Message:

[Killed] BlockStatement
src/services/discountApiService.js:148:16
                 EC: '0',
                 DT: ''
             };
-        } else {
-            return {
-                EM: 'not found discount',
-                EC: '0',
-                DT: ''
-            };
-        }
+        } else {}
     } catch (error) {
         return {
killedBy: Discount API Service deleteDiscount should handle not found discount during deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found discount"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/discountApiService.js:155:21
                 DT: ''
             };
         }
-    } catch (error) {
-        return {
-            EM: 'error deleting discount',
-            EC: '1',
-            DT: ''
-        };
-    }
+    } catch (error) {}
 };
 
killedBy: Discount API Service deleteDiscount should handle error during discount deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting discount"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/discountApiService.js:157:17
         }
     } catch (error) {
         return {
-            EM: 'error deleting discount',
+            EM: "",
             EC: '1',
             DT: ''
killedBy: Discount API Service deleteDiscount should handle error during discount deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting discount"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:
