[Killed] BlockStatement
src/services/customerApiService.js:3:9
 import db from "../models/index";
 const getCustomerById = async (customerId) => {
-    try {
-        let customer = await db.Customers.findOne({
-            where: {
-                id: customerId
-            },
-            include:
-            {
-                model: db.CustomerAccounts
-            }
-        });
-        if (customer) {
-            return {
-                EM: 'get customer by id successfully',
-                EC: '0',
-                DT: customer
-            }
-        }
-        else {
-            return {
-                EM: 'not found customer',
-                EC: '0',
-                DT: null
-            }
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error - get customer by id',
killedBy: Customer API Service getCustomerById should get customer by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "0", "EM": "get customer by id successfully"}
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/customerApiService.js:13:13
                 model: db.CustomerAccounts
             }
         });
-        if (customer) {
+        if (true) {
             return {
                 EM: 'get customer by id successfully',
killedBy: Customer API Service getCustomerById should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "0", "EM": "not found customer"}
Received:
  {"DT": null, "EC": "0", "EM": "get customer by id successfully"}

Message:

[Killed] ConditionalExpression
src/services/customerApiService.js:13:13
                 model: db.CustomerAccounts
             }
         });
-        if (customer) {
+        if (false) {
             return {
                 EM: 'get customer by id successfully',
killedBy: Customer API Service getCustomerById should get customer by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "0", "EM": "get customer by id successfully"}
Received:
  {"DT": null, "EC": "0", "EM": "not found customer"}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:15:21
         });
         if (customer) {
             return {
-                EM: 'get customer by id successfully',
+                EM: "",
                 EC: '0',
                 DT: customer
killedBy: Customer API Service getCustomerById should get customer by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "0", "EM": "get customer by id successfully"}
Received:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "0", "EM": ""}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:16:21
         if (customer) {
             return {
                 EM: 'get customer by id successfully',
-                EC: '0',
+                EC: "",
                 DT: customer
             }
killedBy: Customer API Service getCustomerById should get customer by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "0", "EM": "get customer by id successfully"}
Received:
  {"DT": {"CustomerAccount": {"id": 101}, "id": 1, "name": "John Doe"}, "EC": "", "EM": "get customer by id successfully"}

Message:

[Killed] BlockStatement
src/services/customerApiService.js:20:14
                 DT: customer
             }
         }
-        else {
-            return {
-                EM: 'not found customer',
-                EC: '0',
-                DT: null
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Customer API Service getCustomerById should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "0", "EM": "not found customer"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/customerApiService.js:22:21
         }
         else {
             return {
-                EM: 'not found customer',
+                EM: "",
                 EC: '0',
                 DT: null
killedBy: Customer API Service getCustomerById should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "0", "EM": "not found customer"}
Received:
  {"DT": null, "EC": "0", "EM": ""}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:23:21
         else {
             return {
                 EM: 'not found customer',
-                EC: '0',
+                EC: "",
                 DT: null
             }
killedBy: Customer API Service getCustomerById should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "0", "EM": "not found customer"}
Received:
  {"DT": null, "EC": "", "EM": "not found customer"}

Message:

[Killed] BlockStatement
src/services/customerApiService.js:27:21
                 DT: null
             }
         }
-    } catch (error) {
-        return {
-            EM: 'error - get customer by id',
-            EC: '1',
-            DT: null
-        }
-    }
+    } catch (error) {}
 }
 const getCustomerWithPagination = async (page, limit) => {
killedBy: Customer API Service getCustomerById should handle error during get customer by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "1", "EM": "error - get customer by id"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/customerApiService.js:28:16
             }
         }
     } catch (error) {
-        return {
-            EM: 'error - get customer by id',
-            EC: '1',
-            DT: null
-        }
+        return {}
     }
 }
killedBy: Customer API Service getCustomerById should handle error during get customer by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "1", "EM": "error - get customer by id"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:30:17
     } catch (error) {
         return {
             EM: 'error - get customer by id',
-            EC: '1',
+            EC: "",
             DT: null
         }
killedBy: Customer API Service getCustomerById should handle error during get customer by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "1", "EM": "error - get customer by id"}
Received:
  {"DT": null, "EC": "", "EM": "error - get customer by id"}

Message:

[Killed] EqualityOperator
src/services/customerApiService.js:37:26
 }
 const getCustomerWithPagination = async (page, limit) => {
     try {
-        if (page == 0 && limit === 0) {
+        if (page == 0 && limit !== 0) {
             let data = await db.Customers.findAll();
             return {
killedBy: Customer API Service getCustomerWithPagination should get all data successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": {"customers": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "totalPages": Infinity, "totalRows": 7}, "EC": "0", "EM": "get data successfully"}

Message:

[Killed] EqualityOperator
src/services/customerApiService.js:37:13
 }
 const getCustomerWithPagination = async (page, limit) => {
     try {
-        if (page == 0 && limit === 0) {
+        if (page != 0 && limit === 0) {
             let data = await db.Customers.findAll();
             return {
killedBy: Customer API Service getCustomerWithPagination should get all data successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": {"customers": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "totalPages": Infinity, "totalRows": 7}, "EC": "0", "EM": "get data successfully"}

Message:

[Killed] ObjectLiteral
src/services/customerApiService.js:39:20
     try {
         if (page == 0 && limit === 0) {
             let data = await db.Customers.findAll();
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: data,
-            }
+            return {}
         }
         else {
killedBy: Customer API Service getCustomerWithPagination should get all data successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "EC": "0", "EM": "get data successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:40:21
         if (page == 0 && limit === 0) {
             let data = await db.Customers.findAll();
             return {
-                EM: 'get data successfully',
+                EM: "",
                 EC: '0',
                 DT: data,
killedBy: Customer API Service getCustomerWithPagination should get all data successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "EC": "0", "EM": ""}

Message:

[Killed] BlockStatement
src/services/customerApiService.js:45:14
                 DT: data,
             }
         }
-        else {
-            let offset = (page - 1) * limit;
-            const { count, rows } = await db.Customers.findAndCountAll({
-                offset: offset,
-                limit: limit,
-                order: [["id", "DESC"]],
-                include: [
-                    { model: db.CustomerAccounts }
-                ]
-            });
-            let totalPages = Math.ceil(count / limit);
-            let data = {
-                totalRows: count,
-                totalPages: totalPages,
-                customers: rows,
-            }
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: data,
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Customer API Service getCustomerWithPagination should get paginated data successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"customers": [{"id": 1, "name": "John"}, {"id": 2, "name": "Jane"}], "totalPages": 2, "totalRows": 10}, "EC": "0", "EM": "get data successfully"}
Received:
  undefined

Message:

[Survived] ArithmeticOperator
src/services/customerApiService.js:46:26
             }
         }
         else {
-            let offset = (page - 1) * limit;
+            let offset = (page - 1) / limit;
             const { count, rows } = await db.Customers.findAndCountAll({
                 offset: offset,

[Survived] ArithmeticOperator
src/services/customerApiService.js:46:27
             }
         }
         else {
-            let offset = (page - 1) * limit;
+            let offset = (page + 1) * limit;
             const { count, rows } = await db.Customers.findAndCountAll({
                 offset: offset,

[Survived] ArrayDeclaration
src/services/customerApiService.js:51:26
                 offset: offset,
                 limit: limit,
                 order: [["id", "DESC"]],
-                include: [
-                    { model: db.CustomerAccounts }
-                ]
+                include: []
             });
             let totalPages = Math.ceil(count / limit);

[Survived] ObjectLiteral
src/services/customerApiService.js:52:21
                 limit: limit,
                 order: [["id", "DESC"]],
                 include: [
-                    { model: db.CustomerAccounts }
+                    {}
                 ]
             });

[Killed] BlockStatement
src/services/customerApiService.js:67:21
                 DT: data,
             }
         }
-    } catch (error) {
-        return {
-            EM: 'error - get customer with pagination',
-            EC: '1',
-            DT: null
-        }
-    }
+    } catch (error) {}
 }
 const deleteCustomer = async (id) => {
killedBy: Customer API Service getCustomerWithPagination should handle invalid input parameters
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": null, "EC": "1", "EM": "error - get customer with pagination"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/customerApiService.js:76:9
     }
 }
 const deleteCustomer = async (id) => {
-    try {
-        const customer = await db.Customers.findOne({ where: { id: id } });
-        if (customer) {
-            // Delete CUSTOMER
-            await db.Customers.destroy({
-                where: { id: customer.id }
-            });
-
-            return {
-                EM: 'delete customer successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
-            return {
-                EM: 'not found customer',
-                EC: '0',
-                DT: ''
-            };
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error deleting customer',
killedBy: Customer API Service deleteCustomer should delete customer successfully when customer exists
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete customer successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/customerApiService.js:78:23
 const deleteCustomer = async (id) => {
     try {
         const customer = await db.Customers.findOne({ where: { id: id } });
-        if (customer) {
-            // Delete CUSTOMER
-            await db.Customers.destroy({
-                where: { id: customer.id }
-            });
-
-            return {
-                EM: 'delete customer successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
+        if (customer) {} else {
             return {
                 EM: 'not found customer',
killedBy: Customer API Service deleteCustomer should delete customer successfully when customer exists
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete customer successfully"}
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/customerApiService.js:78:13
 const deleteCustomer = async (id) => {
     try {
         const customer = await db.Customers.findOne({ where: { id: id } });
-        if (customer) {
+        if (true) {
             // Delete CUSTOMER
             await db.Customers.destroy({
killedBy: Customer API Service deleteCustomer should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found customer"}
Received:
  {"DT": "", "EC": "1", "EM": "error deleting customer"}

Message:

[Survived] ObjectLiteral
src/services/customerApiService.js:81:24
         if (customer) {
             // Delete CUSTOMER
             await db.Customers.destroy({
-                where: { id: customer.id }
+                where: {}
             });
 

[Killed] BlockStatement
src/services/customerApiService.js:89:16
                 EC: '0',
                 DT: ''
             };
-        } else {
-            return {
-                EM: 'not found customer',
-                EC: '0',
-                DT: ''
-            };
-        }
+        } else {}
     } catch (error) {
         return {
killedBy: Customer API Service deleteCustomer should handle not found customer
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found customer"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/customerApiService.js:96:21
                 DT: ''
             };
         }
-    } catch (error) {
-        return {
-            EM: 'error deleting customer',
-            EC: '1',
-            DT: ''
-        };
-    }
+    } catch (error) {}
 };
 
killedBy: Customer API Service deleteCustomer should handle errors during customer deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting customer"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/customerApiService.js:98:17
         }
     } catch (error) {
         return {
-            EM: 'error deleting customer',
+            EM: "",
             EC: '1',
             DT: ''
killedBy: Customer API Service deleteCustomer should handle errors during customer deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting customer"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:

[Killed] StringLiteral
src/services/customerApiService.js:99:17
     } catch (error) {
         return {
             EM: 'error deleting customer',
-            EC: '1',
+            EC: "",
             DT: ''
         };
killedBy: Customer API Service deleteCustomer should handle errors during customer deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting customer"}
Received:
  {"DT": "", "EC": "", "EM": "error deleting customer"}

Message:
