[Killed] BlockStatement
src/services/dashboardService.js:2:37
 import db from "../models/index";
-const getTourPlanning = async () => {
-    try {
-        const incompletedTour = await db.Tours.count({
-            where: {
-                tourStatus: 'Incompleted'
-            }
-        })
-        return {
-            EM: 'get tour is planning successfully',
-            EC: '0',
-            DT: incompletedTour
-        }
-    } catch (error) {
-        return {
-            EM: 'error getting tour planning count',
-            EC: '1',
-            DT: undefined
-        }
-    }
-}
+const getTourPlanning = async () => {}
 
 module.exports = { getTourPlanning }
killedBy: Tour API Service getTourPlanning should get tour planning count successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": 5, "EC": "0", "EM": "get tour is planning successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/dashboardService.js:3:9
 import db from "../models/index";
 const getTourPlanning = async () => {
-    try {
-        const incompletedTour = await db.Tours.count({
-            where: {
-                tourStatus: 'Incompleted'
-            }
-        })
-        return {
-            EM: 'get tour is planning successfully',
-            EC: '0',
-            DT: incompletedTour
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error getting tour planning count',
killedBy: Tour API Service getTourPlanning should get tour planning count successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": 5, "EC": "0", "EM": "get tour is planning successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/dashboardService.js:4:54
 import db from "../models/index";
 const getTourPlanning = async () => {
     try {
-        const incompletedTour = await db.Tours.count({
-            where: {
-                tourStatus: 'Incompleted'
-            }
-        })
+        const incompletedTour = await db.Tours.count({})
         return {
             EM: 'get tour is planning successfully',

[Killed] BlockStatement
src/services/dashboardService.js:14:21
             EC: '0',
             DT: incompletedTour
         }
-    } catch (error) {
-        return {
-            EM: 'error getting tour planning count',
-            EC: '1',
-            DT: undefined
-        }
-    }
+    } catch (error) {}
 }
 
killedBy: Tour API Service getTourPlanning should handle errors during tour planning count retrieval
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "error getting tour planning count"}
Received:
  undefined

Message:
