[Survived] ObjectLiteral
src/services/loginService.js:7:53
     try {
         let username = companyUserData.username;
         let password = companyUserData.password;
-        let data = await db.CompanyAccounts.findOne({
-            where: {
-                username: username
-            }
-        })
+        let data = await db.CompanyAccounts.findOne({})
         if (data) {
             if (data.password === password) {

[Survived] ObjectLiteral
src/services/loginService.js:8:20
         let username = companyUserData.username;
         let password = companyUserData.password;
         let data = await db.CompanyAccounts.findOne({
-            where: {
-                username: username
-            }
+            where: {}
         })
         if (data) {

[Killed] BlockStatement
src/services/loginService.js:12:19
                 username: username
             }
         })
-        if (data) {
-            if (data.password === password) {
-                return {
-                    EM: 'Login successfully',
-                    EC: '0',
-                    DT: createJWT({
-                        username: data.username,
-                        role: data.role,
-                        password: data.password
-                    })
-                }
-            }
-            else {
-                return {
-                    EM: 'Wrong password',
-                    EC: '0',
-                    DT: '',
-                }
-            }
-        }
+        if (data) {}
         else {
             return {
killedBy: Login API Service company login should handle company login successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "mockToken", "EC": "0", "EM": "Login successfully"}
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/loginService.js:13:17
             }
         })
         if (data) {
-            if (data.password === password) {
+            if (false) {
                 return {
                     EM: 'Login successfully',
killedBy: Login API Service company login should handle company login successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "mockToken", "EC": "0", "EM": "Login successfully"}
Received:
  {"DT": "", "EC": "0", "EM": "Wrong password"}

Message:

[Killed] BlockStatement
src/services/loginService.js:13:45
             }
         })
         if (data) {
-            if (data.password === password) {
-                return {
-                    EM: 'Login successfully',
-                    EC: '0',
-                    DT: createJWT({
-                        username: data.username,
-                        role: data.role,
-                        password: data.password
-                    })
-                }
-            }
+            if (data.password === password) {}
             else {
                 return {
killedBy: Login API Service company login should handle company login successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "mockToken", "EC": "0", "EM": "Login successfully"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/loginService.js:16:25
             if (data.password === password) {
                 return {
                     EM: 'Login successfully',
-                    EC: '0',
+                    EC: "",
                     DT: createJWT({
                         username: data.username,
killedBy: Login API Service company login should handle company login successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "mockToken", "EC": "0", "EM": "Login successfully"}
Received:
  {"DT": "mockToken", "EC": "", "EM": "Login successfully"}

Message:

[Killed] BlockStatement
src/services/loginService.js:24:18
                     })
                 }
             }
-            else {
-                return {
-                    EM: 'Wrong password',
-                    EC: '0',
-                    DT: '',
-                }
-            }
+            else {}
         }
         else {
killedBy: Login API Service company login should handle wrong password during company login
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "Wrong password"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/loginService.js:26:25
             }
             else {
                 return {
-                    EM: 'Wrong password',
+                    EM: "",
                     EC: '0',
                     DT: '',
killedBy: Login API Service company login should handle wrong password during company login
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "Wrong password"}
Received:
  {"DT": "", "EC": "0", "EM": ""}

Message:

[Killed] BlockStatement
src/services/loginService.js:32:14
                 }
             }
         }
-        else {
-            return {
-                EM: 'Not found user',
-                EC: '0',
-                DT: '',
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Login API Service company login should handle not found user during company login
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "Not found user"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/loginService.js:33:20
             }
         }
         else {
-            return {
-                EM: 'Not found user',
-                EC: '0',
-                DT: '',
-            }
+            return {}
         }
     } catch (error) {
killedBy: Login API Service company login should handle not found user during company login
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "Not found user"}
Received:
  {}

Message:

[Killed] BlockStatement
src/services/loginService.js:39:21
                 DT: '',
             }
         }
-    } catch (error) {
-        return {
-            EM: 'Error when login',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 
killedBy: Login API Service company login should handle error during company login
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Error when login"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/loginService.js:48:18
     }
 }
 
-module.exports = { handleCompanyLogin }
+module.exports = {}
killedBy: Login API Service company login should handle company login successfully
statusReason: TypeError: handleCompanyLogin is not a function
