[Killed] BlockStatement
src/services/packageApiService.js:3:45
 import db from "../models/index"
 import { Sequelize } from "../models/index"
-const getPackageById = async (packageId) => {
-    try {
-        let packageData = await db.Packages.findOne({
-            where: {
-                id: packageId
-            }
-        })
-        return {
-            EM: 'Get Package sucessfully',
-            EC: 0,
-            DT: packageData,
-        }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: 1,
-            DT: '',
-        }
-    }
-}
+const getPackageById = async (packageId) => {}
 const getPackageWithPagination = async (page, limit) => {
     try {
killedBy: Package API Service getPackageById should get package by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1, "packageAddress": "Address A", "packageDescription": "Description A", "packageName": "Package 1", "packageType": "Type A"}, "EC": 0, "EM": "Get Package sucessfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/packageApiService.js:4:9
 import db from "../models/index"
 import { Sequelize } from "../models/index"
 const getPackageById = async (packageId) => {
-    try {
-        let packageData = await db.Packages.findOne({
-            where: {
-                id: packageId
-            }
-        })
-        return {
-            EM: 'Get Package sucessfully',
-            EC: 0,
-            DT: packageData,
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Database error',
killedBy: Package API Service getPackageById should get package by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1, "packageAddress": "Address A", "packageDescription": "Description A", "packageName": "Package 1", "packageType": "Type A"}, "EC": 0, "EM": "Get Package sucessfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/packageApiService.js:5:53
 import { Sequelize } from "../models/index"
 const getPackageById = async (packageId) => {
     try {
-        let packageData = await db.Packages.findOne({
-            where: {
-                id: packageId
-            }
-        })
+        let packageData = await db.Packages.findOne({})
         return {
             EM: 'Get Package sucessfully',

[Survived] ObjectLiteral
src/services/packageApiService.js:6:20
 const getPackageById = async (packageId) => {
     try {
         let packageData = await db.Packages.findOne({
-            where: {
-                id: packageId
-            }
+            where: {}
         })
         return {

[Killed] StringLiteral
src/services/packageApiService.js:11:17
             }
         })
         return {
-            EM: 'Get Package sucessfully',
+            EM: "",
             EC: 0,
             DT: packageData,
killedBy: Package API Service getPackageById should get package by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1, "packageAddress": "Address A", "packageDescription": "Description A", "packageName": "Package 1", "packageType": "Type A"}, "EC": 0, "EM": "Get Package sucessfully"}
Received:
  {"DT": {"id": 1, "packageAddress": "Address A", "packageDescription": "Description A", "packageName": "Package

[Killed] BlockStatement
src/services/packageApiService.js:15:21
             EC: 0,
             DT: packageData,
         }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: 1,
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const getPackageWithPagination = async (page, limit) => {
killedBy: Package API Service getPackageById should handle error during getPackageById
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": 1, "EM": "Database error"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/packageApiService.js:24:9
     }
 }
 const getPackageWithPagination = async (page, limit) => {
-    try {
-        let offset = (page - 1) * limit;
-        const { count, rows } = await db.Packages.findAndCountAll({
-            offset: offset,
-            limit: limit,
-            order: [["id", "DESC"]]
-        });
-        let totalPages = Math.ceil(count / limit);
-        let data = {
-            totalRows: count,
-            totalPages: totalPages,
-            packages: rows,
-        }
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: data,
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Pagination error',
killedBy: Package API Service getPackageWithPagination should get paginated packages successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  undefined

Message:

[Survived] ArrayDeclaration
src/services/packageApiService.js:29:20
         const { count, rows } = await db.Packages.findAndCountAll({
             offset: offset,
             limit: limit,
-            order: [["id", "DESC"]]
+            order: []
         });
         let totalPages = Math.ceil(count / limit);

[Survived] ArrayDeclaration
src/services/packageApiService.js:29:21
         const { count, rows } = await db.Packages.findAndCountAll({
             offset: offset,
             limit: limit,
-            order: [["id", "DESC"]]
+            order: [[]]
         });
         let totalPages = Math.ceil(count / limit);

[Killed] ObjectLiteral
src/services/packageApiService.js:37:16
             totalPages: totalPages,
             packages: rows,
         }
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: data,
-        }
+        return {}
     } catch (error) {
         return {
killedBy: Package API Service getPackageWithPagination should get paginated packages successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  {}

Message:

[Killed] BlockStatement
src/services/packageApiService.js:42:21
             EC: '0',
             DT: data,
         }
-    } catch (error) {
-        return {
-            EM: 'Pagination error',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const getPackageByAddressList = async (addressList) => {
killedBy: Package API Service getPackageWithPagination should handle error during getPackageWithPagination
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Pagination error"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/packageApiService.js:44:17
         }
     } catch (error) {
         return {
-            EM: 'Pagination error',
+            EM: "",
             EC: '1',
             DT: '',
killedBy: Package API Service getPackageWithPagination should handle error during getPackageWithPagination
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Pagination error"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:

[Killed] StringLiteral
src/services/packageApiService.js:45:17
     } catch (error) {
         return {
             EM: 'Pagination error',
-            EC: '1',
+            EC: "",
             DT: '',
         }
killedBy: Package API Service getPackageWithPagination should handle error during getPackageWithPagination
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Pagination error"}
Received:
  {"DT": "", "EC": "", "EM": "Pagination error"}

Message:

[Killed] BlockStatement
src/services/packageApiService.js:51:9
     }
 }
 const getPackageByAddressList = async (addressList) => {
-    try {
-        if (addressList != null && addressList != []) {
-            const addresses = addressList.split('|').filter(Boolean);
-            const whereCondition = { packageAddress: { [Sequelize.Op.in]: addresses } };
-            const data = await db.Packages.findAll({
-                where: whereCondition
-            });
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: data,
-            }
-        }
-        else {
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: [],
-            }
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Query error',
killedBy: Package API Service getPackageByAddressList should get packages by address list successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  undefined

Message:

[Killed] ConditionalExpression
src/services/packageApiService.js:52:13
 }
 const getPackageByAddressList = async (addressList) => {
     try {
-        if (addressList != null && addressList != []) {
+        if (false) {
             const addresses = addressList.split('|').filter(Boolean);
             const whereCondition = { packageAddress: { [Sequelize.Op.in]: addresses } };
killedBy: Package API Service getPackageByAddressList should get packages by address list successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  {"DT": [], "EC": "0", "EM": "get data successfully"}

Message:

[Killed] EqualityOperator
src/services/packageApiService.js:52:36
 }
 const getPackageByAddressList = async (addressList) => {
     try {
-        if (addressList != null && addressList != []) {
+        if (addressList != null && addressList == []) {
             const addresses = addressList.split('|').filter(Boolean);
             const whereCondition = { packageAddress: { [Sequelize.Op.in]: addresses } };
killedBy: Package API Service getPackageByAddressList should get packages by address list successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
Received:
  {"DT": [], "EC": "0", "EM": "get data successfully"}

Message:

[Survived] MethodExpression
src/services/packageApiService.js:53:31
 const getPackageByAddressList = async (addressList) => {
     try {
         if (addressList != null && addressList != []) {
-            const addresses = addressList.split('|').filter(Boolean);
+            const addresses = addressList.split('|');
             const whereCondition = { packageAddress: { [Sequelize.Op.in]: addresses } };
             const data = await db.Packages.findAll({

[Survived] ObjectLiteral
src/services/packageApiService.js:54:54
     try {
         if (addressList != null && addressList != []) {
             const addresses = addressList.split('|').filter(Boolean);
-            const whereCondition = { packageAddress: { [Sequelize.Op.in]: addresses } };
+            const whereCondition = { packageAddress: {} };
             const data = await db.Packages.findAll({
                 where: whereCondition

[Killed] BlockStatement
src/services/packageApiService.js:64:14
                 DT: data,
             }
         }
-        else {
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: [],
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Package API Service getPackageByAddressList should handle empty address list
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [], "EC": "0", "EM": "get data successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/packageApiService.js:71:21
                 DT: [],
             }
         }
-    } catch (error) {
-        return {
-            EM: 'Query error',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const createPackage = async (packageData) => {
killedBy: Package API Service getPackageByAddressList should handle error during getPackageByAddressList
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Query error"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/packageApiService.js:73:17
         }
     } catch (error) {
         return {
-            EM: 'Query error',
+            EM: "",
             EC: '1',
             DT: '',
killedBy: Package API Service getPackageByAddressList should handle error during getPackageByAddressList
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Query error"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:

[Killed] StringLiteral
src/services/packageApiService.js:74:17
     } catch (error) {
         return {
             EM: 'Query error',
-            EC: '1',
+            EC: "",
             DT: '',
         }
killedBy: Package API Service getPackageByAddressList should handle error during getPackageByAddressList
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Query error"}
Received:
  {"DT": "", "EC": "", "EM": "Query error"}

Message:

[Killed] BlockStatement
src/services/packageApiService.js:79:46
         }
     }
 }
-const createPackage = async (packageData) => {
-    try {
-        const data = await db.Packages.create({
-            packageName: packageData.packageName,
-            packageType: packageData.packageType,
-            packageAddress: packageData.packageAddress,
-            packageDescription: packageData.packageDescription
-        });
-        return {
-            EM: 'create package successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
-        return {
-            EM: 'database error',
-            EC: '1',
-            DT: '',
-        }
-    }
-}
+const createPackage = async (packageData) => {}
 const updatePackage = async (packageData) => {
     try {
killedBy: Package API Service createPackage should create a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"packageAddress": "Test Address", "packageDescription": "Test Description", "packageName": "Test Package", "packageType": "Test Type"}, "EC": "0", "EM": "create package successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/packageApiService.js:80:9
     }
 }
 const createPackage = async (packageData) => {
-    try {
-        const data = await db.Packages.create({
-            packageName: packageData.packageName,
-            packageType: packageData.packageType,
-            packageAddress: packageData.packageAddress,
-            packageDescription: packageData.packageDescription
-        });
-        return {
-            EM: 'create package successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'database error',
killedBy: Package API Service createPackage should create a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"packageAddress": "Test Address", "packageDescription": "Test Description", "packageName": "Test Package", "packageType": "Test Type"}, "EC": "0", "EM": "create package successfully"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/packageApiService.js:88:17
             packageDescription: packageData.packageDescription
         });
         return {
-            EM: 'create package successfully',
+            EM: "",
             EC: '0',
             DT: data
killedBy: Package API Service createPackage should create a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"packageAddress": "Test Address", "packageDescription": "Test Description", "packageName": "Test Package", "packageType": "Test Type"}, "EC": "0", "EM": "create package successfully"}
Received:
  {"DT": {"packageAddress": "Test Address", "packageDescription": "Test Description", "packageName": "Te

[Killed] BlockStatement
src/services/packageApiService.js:92:21
             EC: '0',
             DT: data
         }
-    } catch (error) {
-        return {
-            EM: 'database error',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const updatePackage = async (packageData) => {
killedBy: Package API Service createPackage should handle error during package creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "database error"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/packageApiService.js:103:20
 const updatePackage = async (packageData) => {
     try {
         let data = await db.Packages.findOne({
-            where: { id: packageData.id }
+            where: {}
         })
         if (data) {

[Killed] BlockStatement
src/services/packageApiService.js:105:19
         let data = await db.Packages.findOne({
             where: { id: packageData.id }
         })
-        if (data) {
-            let res = await db.Packages.update({
-                packageName: packageData.packageName,
-                packageAddress: packageData.packageAddress,
-                packageType: packageData.packageType,
-                packageDescription: packageData.packageDescription
-            }, {
-                where: {
-                    id: packageData.id
-                }
-            })
-            return {
-                EM: 'update package successfully',
-                EC: '0',
-                DT: '',
-            }
-        }
+        if (data) {}
         else {
             return {
killedBy: Package API Service updatePackage should update a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update package successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/packageApiService.js:112:24
                 packageType: packageData.packageType,
                 packageDescription: packageData.packageDescription
             }, {
-                where: {
-                    id: packageData.id
-                }
+                where: {}
             })
             return {

[Killed] ObjectLiteral
src/services/packageApiService.js:116:20
                     id: packageData.id
                 }
             })
-            return {
-                EM: 'update package successfully',
-                EC: '0',
-                DT: '',
-            }
+            return {}
         }
         else {
killedBy: Package API Service updatePackage should update a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update package successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/packageApiService.js:117:21
                 }
             })
             return {
-                EM: 'update package successfully',
+                EM: "",
                 EC: '0',
                 DT: '',
killedBy: Package API Service updatePackage should update a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update package successfully"}
Received:
  {"DT": "", "EC": "0", "EM": ""}

Message:

[Killed] BlockStatement
src/services/packageApiService.js:122:14
                 DT: '',
             }
         }
-        else {
-            return {
-                EM: 'not found package',
-                EC: '0',
-                DT: '',
-            }
-        }
+        else {}
 
     } catch (error) {
killedBy: Package API Service updatePackage should handle not found package during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found package"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/packageApiService.js:125:21
         else {
             return {
                 EM: 'not found package',
-                EC: '0',
+                EC: "",
                 DT: '',
             }
killedBy: Package API Service updatePackage should handle not found package during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found package"}
Received:
  {"DT": "", "EC": "", "EM": "not found package"}

Message:

[Killed] BlockStatement
src/services/packageApiService.js:130:21
             }
         }
 
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 const deletePackage = async (id) => {
killedBy: Package API Service updatePackage should handle error when updating a package
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/packageApiService.js:139:9
     }
 }
 const deletePackage = async (id) => {
-    try {
-        let data = await db.Packages.findOne({
-            where: { id: id }
-        })
-        if (data) {
-            let res = await db.Packages.destroy({
-                where: { id: id }
-            });
-            console.log(res);
-            return {
-                EM: 'delete package successfully',
-                EC: '0',
-                DT: '',
-            }
-        }
-        else {
-            return {
-                EM: 'not found package',
-                EC: '0',
-                DT: '',
-            }
-        }
-
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Database error',
killedBy: Package API Service deletePackage should delete a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete package successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/packageApiService.js:141:20
 const deletePackage = async (id) => {
     try {
         let data = await db.Packages.findOne({
-            where: { id: id }
+            where: {}
         })
         if (data) {

[Killed] BlockStatement
src/services/packageApiService.js:143:19
         let data = await db.Packages.findOne({
             where: { id: id }
         })
-        if (data) {
-            let res = await db.Packages.destroy({
-                where: { id: id }
-            });
-            console.log(res);
-            return {
-                EM: 'delete package successfully',
-                EC: '0',
-                DT: '',
-            }
-        }
+        if (data) {}
         else {
             return {
killedBy: Package API Service deletePackage should delete a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete package successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/packageApiService.js:144:49
             where: { id: id }
         })
         if (data) {
-            let res = await db.Packages.destroy({
-                where: { id: id }
-            });
+            let res = await db.Packages.destroy({});
             console.log(res);
             return {

[Survived] ObjectLiteral
src/services/packageApiService.js:145:24
         })
         if (data) {
             let res = await db.Packages.destroy({
-                where: { id: id }
+                where: {}
             });
             console.log(res);

[Killed] ObjectLiteral
src/services/packageApiService.js:148:20
                 where: { id: id }
             });
             console.log(res);
-            return {
-                EM: 'delete package successfully',
-                EC: '0',
-                DT: '',
-            }
+            return {}
         }
         else {
killedBy: Package API Service deletePackage should delete a package successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete package successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/packageApiService.js:156:21
         }
         else {
             return {
-                EM: 'not found package',
+                EM: "",
                 EC: '0',
                 DT: '',
killedBy: Package API Service deletePackage should handle not found package during deletion
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found package"}
Received:
  {"DT": "", "EC": "0", "EM": ""}

Message:

[Killed] StringLiteral
src/services/packageApiService.js:164:17
 
     } catch (error) {
         return {
-            EM: 'Database error',
+            EM: "",
             EC: '1',
             DT: '',
killedBy: Package API Service deletePackage should handle error when deleting a package
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:
