[Survived] EqualityOperator
src/services/tourApiService.js:17:25
 
         // Tạo TOURADDITIONALIMAGES và liên kết nó với TOUR
         const additionalImages = tourData.additionalImages; // Đây là một mảng các id của các ảnh bổ sung
-        for (let i = 0; i < additionalImages.length; i++) {
+        for (let i = 0; i >= additionalImages.length; i++) {
             await db.TourAdditionalImages.create({
                 tourId: createdTour.id, // id của TOUR đã tạo

[Survived] EqualityOperator
src/services/tourApiService.js:17:25
 
         // Tạo TOURADDITIONALIMAGES và liên kết nó với TOUR
         const additionalImages = tourData.additionalImages; // Đây là một mảng các id của các ảnh bổ sung
-        for (let i = 0; i < additionalImages.length; i++) {
+        for (let i = 0; i <= additionalImages.length; i++) {
             await db.TourAdditionalImages.create({
                 tourId: createdTour.id, // id của TOUR đã tạo

[Killed] UpdateOperator
src/services/tourApiService.js:27:50
         // Tạo TOURSCHEDULE và liên kết nó với TOUR
         const tourSchedule = tourData.tourSchedule;
         const daySummaries = tourData.daySummaries;
-        for (let i = 0; i < tourSchedule.length; i++) {
+        for (let i = 0; i < tourSchedule.length; i--) {
             const createdSchedule = await db.TourSchedules.create({
                 tourId: createdTour.id, // id của TOUR đã tạo
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {"DT": "", "EC": "1", "EM": "Database error"}

Message:

[Killed] EqualityOperator
src/services/tourApiService.js:27:25
         // Tạo TOURSCHEDULE và liên kết nó với TOUR
         const tourSchedule = tourData.tourSchedule;
         const daySummaries = tourData.daySummaries;
-        for (let i = 0; i < tourSchedule.length; i++) {
+        for (let i = 0; i <= tourSchedule.length; i++) {
             const createdSchedule = await db.TourSchedules.create({
                 tourId: createdTour.id, // id của TOUR đã tạo
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {"DT": "", "EC": "1", "EM": "Database error"}

Message:

[Survived] ObjectLiteral
src/services/tourApiService.js:28:67
         const tourSchedule = tourData.tourSchedule;
         const daySummaries = tourData.daySummaries;
         for (let i = 0; i < tourSchedule.length; i++) {
-            const createdSchedule = await db.TourSchedules.create({
-                tourId: createdTour.id, // id của TOUR đã tạo
-                dayIndex: i + 1, // hoặc bạn có thể sử dụng i nếu DayIndex bắt đầu từ 0
-                daySummary: daySummaries[i]
-            });
+            const createdSchedule = await db.TourSchedules.create({});
             // Tạo TOURPACKAGE và liên kết nó với TOURSCHEDULE và PACKAGE
             for (let j = 0; j < tourSchedule[i].length; j++) {

[Survived] ArithmeticOperator
src/services/tourApiService.js:30:27
         for (let i = 0; i < tourSchedule.length; i++) {
             const createdSchedule = await db.TourSchedules.create({
                 tourId: createdTour.id, // id của TOUR đã tạo
-                dayIndex: i + 1, // hoặc bạn có thể sử dụng i nếu DayIndex bắt đầu từ 0
+                dayIndex: i - 1, // hoặc bạn có thể sử dụng i nếu DayIndex bắt đầu từ 0
                 daySummary: daySummaries[i]
             });

[Killed] UpdateOperator
src/services/tourApiService.js:34:57
                 daySummary: daySummaries[i]
             });
             // Tạo TOURPACKAGE và liên kết nó với TOURSCHEDULE và PACKAGE
-            for (let j = 0; j < tourSchedule[i].length; j++) {
+            for (let j = 0; j < tourSchedule[i].length; j--) {
                 await db.TourPackages.create({
                     tourScheduleId: createdSchedule.id, // id của TOURSCHEDULE đã tạo
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {"DT": "", "EC": "1", "EM": "Database error"}

Message:

[Killed] EqualityOperator
src/services/tourApiService.js:34:29
                 daySummary: daySummaries[i]
             });
             // Tạo TOURPACKAGE và liên kết nó với TOURSCHEDULE và PACKAGE
-            for (let j = 0; j < tourSchedule[i].length; j++) {
+            for (let j = 0; j <= tourSchedule[i].length; j++) {
                 await db.TourPackages.create({
                     tourScheduleId: createdSchedule.id, // id của TOURSCHEDULE đã tạo
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {"DT": "", "EC": "1", "EM": "Database error"}

Message:

[Killed] ObjectLiteral
src/services/tourApiService.js:41:16
                 });
             }
         }
-        return {
-            EM: 'create tour successfully',
-            EC: '0',
-            DT: ''
-        }
+        return {}
     } catch (error) {
         return {
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/tourApiService.js:43:17
         }
         return {
             EM: 'create tour successfully',
-            EC: '0',
+            EC: "",
             DT: ''
         }
killedBy: Tour API Service createTour should create a tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "create tour successfully"}
Received:
  {"DT": "", "EC": "", "EM": "create tour successfully"}

Message:

[Killed] BlockStatement
src/services/tourApiService.js:46:21
             EC: '0',
             DT: ''
         }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: ''
-        }
-    }
+    } catch (error) {}
 }
 const getTourById = async (tourId) => {
killedBy: Tour API Service createTour should handle error during tour creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/tourApiService.js:47:16
             DT: ''
         }
     } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: ''
-        }
+        return {}
     }
 }
killedBy: Tour API Service createTour should handle error during tour creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/tourApiService.js:49:17
     } catch (error) {
         return {
             EM: 'Database error',
-            EC: '1',
+            EC: "",
             DT: ''
         }
killedBy: Tour API Service createTour should handle error during tour creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  {"DT": "", "EC": "", "EM": "Database error"}

Message:

[Killed] StringLiteral
src/services/tourApiService.js:50:17
         return {
             EM: 'Database error',
             EC: '1',
-            DT: ''
+            DT: "Stryker was here!"
         }
     }
killedBy: Tour API Service createTour should handle error during tour creation
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  {"DT": "Stryker was here!", "EC": "1", "EM": "Database error"}

Message:

[Survived] ArrayDeclaration
src/services/tourApiService.js:67:30
             include: [
                 {
                     model: db.TourSchedules,
-                    include: [
-                        {
-                            model: db.Packages
-                        }
-                    ]
+                    include: []
                 }, {
                     model: db.TourAdditionalImages

[Killed] EqualityOperator
src/services/tourApiService.js:92:27
 }
 const getTourWithPagination = async (page, limit) => {
     try {
-        if (page === 0 && limit === 0) {
+        if (page === 0 && limit !== 0) {
             let tours = await db.Tours.findAll();
             return {
killedBy: Tour API Service getTourWithPagination should get all tours successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "tourName": "Tour 1"}, {"id": 2, "tourName": "Tour 2"}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": {"totalPages": Infinity, "totalRows": 7, "tours": [{"id": 1, "tourName": "Tour 1"}, {"id": 2, "tourName": "Tour 2"}]}, "EC": "0", "EM": "get data successfully"}

Message:

[Killed] ConditionalExpression
src/services/tourApiService.js:92:13
 }
 const getTourWithPagination = async (page, limit) => {
     try {
-        if (page === 0 && limit === 0) {
+        if (false) {
             let tours = await db.Tours.findAll();
             return {
killedBy: Tour API Service getTourWithPagination should get all tours successfully when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "tourName": "Tour 1"}, {"id": 2, "tourName": "Tour 2"}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": {"totalPages": Infinity, "totalRows": 7, "tours": [{"id": 1, "tourName": "Tour 1"}, {"id": 2, "tourName": "Tour 2"}]}, "EC": "0", "EM": "get data successfully"}

Message:

[Killed] BlockStatement
src/services/tourApiService.js:100:14
                 DT: tours,
             }
         }
-        else {
-            let offset = (page - 1) * limit;
-            const { count, rows } = await db.Tours.findAndCountAll({
-                offset: offset,
-                limit: limit,
-                order: [["id", "DESC"]]
-            });
-            let totalPages = Math.ceil(count / limit);
-            let data = {
-                totalRows: count,
-                totalPages: totalPages,
-                tours: rows,
-            }
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: data,
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Tour API Service getTourWithPagination should get paginated tours successfully when page and limit are not 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"totalPages": 2, "totalRows": 20, "tours": [{"id": 1, "tourName": "Tour 1"}, {"id": 2, "tourName": "Tour 2"}]}, "EC": "0", "EM": "get data successfully"}
Received:
  undefined

Message:

[Survived] StringLiteral
src/services/tourApiService.js:105:32
             const { count, rows } = await db.Tours.findAndCountAll({
                 offset: offset,
                 limit: limit,
-                order: [["id", "DESC"]]
+                order: [["id", ""]]
             });
             let totalPages = Math.ceil(count / limit);

[Survived] ObjectLiteral
src/services/tourApiService.js:129:43
 }
 const updateTour = async (tourData) => {
     try {
-        let data = await db.Tours.findOne({
-            where: { id: tourData.id }
-        })
+        let data = await db.Tours.findOne({})
 
         if (data) {

[Survived] StringLiteral
src/services/tourApiService.js:157:30
 
             // Fetch TOURSCHEDULE IDs associated with the tour
             const scheduleIds = await db.TourSchedules.findAll({
-                attributes: ['id'],
+                attributes: [""],
                 where: { tourId: tourData.id }
             });

[Survived] ObjectLiteral
src/services/tourApiService.js:158:24
             // Fetch TOURSCHEDULE IDs associated with the tour
             const scheduleIds = await db.TourSchedules.findAll({
                 attributes: ['id'],
-                where: { tourId: tourData.id }
+                where: {}
             });
 

[Survived] ArrowFunction
src/services/tourApiService.js:163:58
 
             // Delete TOURPACKAGE
             await db.TourPackages.destroy({
-                where: { tourScheduleId: scheduleIds.map(schedule => schedule.id) }
+                where: { tourScheduleId: scheduleIds.map(() => undefined) }
             });
 

[Survived] BlockStatement
src/services/tourApiService.js:175:63
             // Create Tour Schedules, Tour Packages, Tour Additional Images again
             // Tạo TOURADDITIONALIMAGES và liên kết nó với TOUR
             const additionalImages = tourData.additionalImages; // Đây là một mảng các id của các ảnh bổ sung
-            for (let i = 0; i < additionalImages.length; i++) {
-                await db.TourAdditionalImages.create({
-                    tourId: tourData.id, // id của TOUR đã tạo
-                    additionalImage: additionalImages[i] // id của ảnh bổ sung
-                });
-            }
+            for (let i = 0; i < additionalImages.length; i++) {}
 
             // Tạo TOURSCHEDULE và liên kết nó với TOUR

[Survived] ObjectLiteral
src/services/tourApiService.js:176:54
             // Tạo TOURADDITIONALIMAGES và liên kết nó với TOUR
             const additionalImages = tourData.additionalImages; // Đây là một mảng các id của các ảnh bổ sung
             for (let i = 0; i < additionalImages.length; i++) {
-                await db.TourAdditionalImages.create({
-                    tourId: tourData.id, // id của TOUR đã tạo
-                    additionalImage: additionalImages[i] // id của ảnh bổ sung
-                });
+                await db.TourAdditionalImages.create({});
             }
 

[Survived] ArithmeticOperator
src/services/tourApiService.js:188:31
             for (let i = 0; i < tourSchedule.length; i++) {
                 const createdSchedule = await db.TourSchedules.create({
                     tourId: tourData.id, // id của TOUR đã tạo
-                    dayIndex: i + 1, // hoặc bạn có thể sử dụng i nếu DayIndex bắt đầu từ 0
+                    dayIndex: i - 1, // hoặc bạn có thể sử dụng i nếu DayIndex bắt đầu từ 0
                     daySummary: daySummaries[i]
                 });

[Killed] ObjectLiteral
src/services/tourApiService.js:201:20
             }
 
 
-            return {
-                EM: 'update package successfully',
-                EC: '0',
-                DT: '',
-            }
+            return {}
         }
         else {
killedBy: Tour API Service updateTour should update tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update package successfully"}
Received:
  {}

Message:

[Killed] BlockStatement
src/services/tourApiService.js:207:14
                 DT: '',
             }
         }
-        else {
-            return {
-                EM: 'not found data',
-                EC: '0',
-                DT: ''
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Tour API Service updateTour should handle not found data during updateTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found data"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/tourApiService.js:209:21
         }
         else {
             return {
-                EM: 'not found data',
+                EM: "",
                 EC: '0',
                 DT: ''
killedBy: Tour API Service updateTour should handle not found data during updateTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found data"}
Received:
  {"DT": "", "EC": "0", "EM": ""}

Message:

[Killed] ConditionalExpression
src/services/tourApiService.js:226:13
     try {
         const tour = await db.Tours.findOne({ where: { id: id } });
 
-        if (tour) {
+        if (false) {
             // Delete TOURADDITIONALIMAGES
             await db.TourAdditionalImages.destroy({
killedBy: Tour API Service deleteTour should delete tour successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete tour successfully"}
Received:
  {"DT": "", "EC": "0", "EM": "not found tour"}

Message:

[Killed] ConditionalExpression
src/services/tourApiService.js:226:13
     try {
         const tour = await db.Tours.findOne({ where: { id: id } });
 
-        if (tour) {
+        if (true) {
             // Delete TOURADDITIONALIMAGES
             await db.TourAdditionalImages.destroy({
killedBy: Tour API Service deleteTour should handle not found tour during deleteTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found tour"}
Received:
  {"DT": "", "EC": "1", "EM": "error deleting tour"}

Message:

[Survived] ObjectLiteral
src/services/tourApiService.js:228:51
 
         if (tour) {
             // Delete TOURADDITIONALIMAGES
-            await db.TourAdditionalImages.destroy({
-                where: { tourId: tour.id }
-            });
+            await db.TourAdditionalImages.destroy({});
 
             // Fetch TOURSCHEDULE IDs associated with the tour

[Survived] ObjectLiteral
src/services/tourApiService.js:229:24
         if (tour) {
             // Delete TOURADDITIONALIMAGES
             await db.TourAdditionalImages.destroy({
-                where: { tourId: tour.id }
+                where: {}
             });
 

[Survived] ObjectLiteral
src/services/tourApiService.js:245:24
 
             // Delete TOURSCHEDULE
             await db.TourSchedules.destroy({
-                where: { tourId: tour.id }
+                where: {}
             });
 

[Killed] BlockStatement
src/services/tourApiService.js:258:16
                 EC: '0',
                 DT: ''
             };
-        } else {
-            return {
-                EM: 'not found tour',
-                EC: '0',
-                DT: ''
-            };
-        }
+        } else {}
     } catch (error) {
         return {
killedBy: Tour API Service deleteTour should handle not found tour during deleteTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found tour"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/tourApiService.js:265:21
                 DT: ''
             };
         }
-    } catch (error) {
-        return {
-            EM: 'error deleting tour',
-            EC: '1',
-            DT: ''
-        };
-    }
+    } catch (error) {}
 };
 
killedBy: Tour API Service deleteTour should handle database error during deleteTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting tour"}
Received:
  undefined

Message:

[Killed] StringLiteral
src/services/tourApiService.js:268:17
     } catch (error) {
         return {
             EM: 'error deleting tour',
-            EC: '1',
+            EC: "",
             DT: ''
         };
killedBy: Tour API Service deleteTour should handle database error during deleteTour
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting tour"}
Received:
  {"DT": "", "EC": "", "EM": "error deleting tour"}

Message:
