[Killed] BlockStatement
src/services/tourPackageApiService.js:2:39
 import db from "../models/index";
-const getAllTourPackage = async () => {
-    try {
-        let tourpackages = await db.TourPackages.findAll();
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: tourpackages,
-        }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: '',
-        }
-    }
-}
+const getAllTourPackage = async () => {}
 
 module.exports = { getAllTourPackage };
killedBy: Tour Package API Service - getAllTourPackage should get all tour packages successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "Tour Package 1"}, {"id": 2, "name": "Tour Package 2"}], "EC": "0", "EM": "get data successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/tourPackageApiService.js:3:9
 import db from "../models/index";
 const getAllTourPackage = async () => {
-    try {
-        let tourpackages = await db.TourPackages.findAll();
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: tourpackages,
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Database error',
killedBy: Tour Package API Service - getAllTourPackage should get all tour packages successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "Tour Package 1"}, {"id": 2, "name": "Tour Package 2"}], "EC": "0", "EM": "get data successfully"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/tourPackageApiService.js:5:16
 const getAllTourPackage = async () => {
     try {
         let tourpackages = await db.TourPackages.findAll();
-        return {
-            EM: 'get data successfully',
-            EC: '0',
-            DT: tourpackages,
-        }
+        return {}
     } catch (error) {
         return {
killedBy: Tour Package API Service - getAllTourPackage should get all tour packages successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1, "name": "Tour Package 1"}, {"id": 2, "name": "Tour Package 2"}], "EC": "0", "EM": "get data successfully"}
Received:
  {}

Message:

[Killed] BlockStatement
src/services/tourPackageApiService.js:10:21
             EC: '0',
             DT: tourpackages,
         }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: '',
-        }
-    }
+    } catch (error) {}
 }
 
killedBy: Tour Package API Service - getAllTourPackage should handle error when getting all tour packages
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  undefined

Message:
