[Killed] BlockStatement
src/services/travelApiService.js:2:44
 import db from "../models/index";
-const createTravel = async (travelData) => {
-    try {
-        let data = await db.Travels.create({
-            startLocation: travelData.startLocation,
-            startDateTime: travelData.startDateTime,
-            maxTicket: travelData.maxTicket,
-            remainTicket: travelData.remainTicket,
-            travelPrice: travelData.travelPrice,
-            discountId: travelData.discountId,
-            tourId: travelData.tourId
-        })
-        return {
-            EM: 'create travel successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: ''
-        }
-    }
-}
+const createTravel = async (travelData) => {}
 const getTravelById = async (travelId) => {
     try {
killedBy: Travel API Service createTravel should create a travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountId": 1, "maxTicket": 100, "remainTicket": 50, "startDateTime": 2024-01-02T19:54:41.189Z, "startLocation": "City A", "tourId": 123, "travelPrice": 200.5}, "EC": "0", "EM": "create travel successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/travelApiService.js:3:9
 import db from "../models/index";
 const createTravel = async (travelData) => {
-    try {
-        let data = await db.Travels.create({
-            startLocation: travelData.startLocation,
-            startDateTime: travelData.startDateTime,
-            maxTicket: travelData.maxTicket,
-            remainTicket: travelData.remainTicket,
-            travelPrice: travelData.travelPrice,
-            discountId: travelData.discountId,
-            tourId: travelData.tourId
-        })
-        return {
-            EM: 'create travel successfully',
-            EC: '0',
-            DT: data
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'Database error',
killedBy: Travel API Service createTravel should create a travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountId": 1, "maxTicket": 100, "remainTicket": 50, "startDateTime": 2024-01-02T19:54:41.313Z, "startLocation": "City A", "tourId": 123, "travelPrice": 200.5}, "EC": "0", "EM": "create travel successfully"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:4:44
 import db from "../models/index";
 const createTravel = async (travelData) => {
     try {
-        let data = await db.Travels.create({
-            startLocation: travelData.startLocation,
-            startDateTime: travelData.startDateTime,
-            maxTicket: travelData.maxTicket,
-            remainTicket: travelData.remainTicket,
-            travelPrice: travelData.travelPrice,
-            discountId: travelData.discountId,
-            tourId: travelData.tourId
-        })
+        let data = await db.Travels.create({})
         return {
             EM: 'create travel successfully',
killedBy: Travel API Service createTravel should create a travel successfully
statusReason: AssertError: expected create to be called once and with exact arguments 
{} {
  startLocation: 'City A',
  startDateTime: 2024-01-02T19:54:41.217Z,
  maxTicket: 100,
  remainTicket: 50,
  travelPrice: 200.5,
  discountId: 1,

[Killed] ObjectLiteral
src/services/travelApiService.js:13:16
             discountId: travelData.discountId,
             tourId: travelData.tourId
         })
-        return {
-            EM: 'create travel successfully',
-            EC: '0',
-            DT: data
-        }
+        return {}
     } catch (error) {
         return {
killedBy: Travel API Service createTravel should create a travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"discountId": 1, "maxTicket": 100, "remainTicket": 50, "startDateTime": 2024-01-02T19:54:41.189Z, "startLocation": "City A", "tourId": 123, "travelPrice": 200.5}, "EC": "0", "EM": "create travel successfully"}
Received:
  {}

Message:

[Survived] ArrayDeclaration
src/services/travelApiService.js:32:22
             where: {
                 id: travelId
             },
-            include: [
-                {
-                    model: db.Tours,
-                    include: [{
-                        model: db.TourAdditionalImages
-                    },
-                    {
-                        model: db.TourSchedules,
-                        include: {
-                            model: db.Packages
-                        }
-                    }]
-                },
-                {
-                    model: db.Discounts
-                }
-            ]
+            include: []
 
         });

[Survived] ArrayDeclaration
src/services/travelApiService.js:35:30
             include: [
                 {
                     model: db.Tours,
-                    include: [{
-                        model: db.TourAdditionalImages
-                    },
-                    {
-                        model: db.TourSchedules,
-                        include: {
-                            model: db.Packages
-                        }
-                    }]
+                    include: []
                 },
                 {

[Killed] StringLiteral
src/services/travelApiService.js:52:17
 
         });
         return {
-            EM: 'get travel by id successfully',
+            EM: "",
             EC: '0',
             DT: travel
killedBy: Travel API Service getTravelById should get travel by id successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"id": 1}, "EC": "0", "EM": "get travel by id successfully"}
Received:
  {"DT": {"id": 1}, "EC": "0", "EM": ""}

Message:

[Killed] BlockStatement
src/services/travelApiService.js:56:21
             EC: '0',
             DT: travel
         }
-    } catch (error) {
-        return {
-            EM: 'Error - get travel by id',
-            EC: '1',
-            DT: undefined,
-        }
-    }
+    } catch (error) {}
 }
 const getTravelWithPagination = async (page, limit) => {
killedBy: Travel API Service getTravelById should handle error when getting travel by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "Error - get travel by id"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:57:16
             DT: travel
         }
     } catch (error) {
-        return {
-            EM: 'Error - get travel by id',
-            EC: '1',
-            DT: undefined,
-        }
+        return {}
     }
 }
killedBy: Travel API Service getTravelById should handle error when getting travel by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "Error - get travel by id"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/travelApiService.js:59:17
     } catch (error) {
         return {
             EM: 'Error - get travel by id',
-            EC: '1',
+            EC: "",
             DT: undefined,
         }
killedBy: Travel API Service getTravelById should handle error when getting travel by id
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": undefined, "EC": "1", "EM": "Error - get travel by id"}
Received:
  {"DT": undefined, "EC": "", "EM": "Error - get travel by id"}

Message:

[Killed] EqualityOperator
src/services/travelApiService.js:66:13
 }
 const getTravelWithPagination = async (page, limit) => {
     try {
-        if (page === 0 && limit === 0) {
+        if (page !== 0 && limit === 0) {
             let travels = await db.Travels.findAll(
                 {
killedBy: Travel API Service getTravelWithPagination should get all travels when page and limit are 0
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": [{"id": 1}], "EC": "0", "EM": "get data successfully"}
Received:
  {"DT": {"totalPages": Infinity, "totalRows": 6, "travels": [{"id": 1}]}, "EC": "0", "EM": "get data successfully"}

Message:

[Killed] ConditionalExpression
src/services/travelApiService.js:66:13
 }
 const getTravelWithPagination = async (page, limit) => {
     try {
-        if (page === 0 && limit === 0) {
+        if (true) {
             let travels = await db.Travels.findAll(
                 {
killedBy: Travel API Service getTravelWithPagination should get paginated travels when page and limit are specified
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": {"totalPages": 1, "totalRows": 1, "travels": [{"id": 1}]}, "EC": "0", "EM": "get data successfully"}
Received:

Message:

[Timeout] BlockStatement
src/services/travelApiService.js:83:14
                 DT: travels,
             }
         }
-        else {
-            let offset = (page - 1) * limit;
-            const { count, rows } = await db.Travels.findAndCountAll({
-                offset: offset,
-                limit: limit,
-                order: [["id", "DESC"]],
-                include: [
-                    { model: db.Tours }
-                ]
-            });
-            let totalPages = Math.ceil(count / limit);
-            let data = {
-                totalRows: count,
-                totalPages: totalPages,
-                travels: rows,
-            }
-            return {
-                EM: 'get data successfully',
-                EC: '0',
-                DT: data,
-            }
-        }
+        else {}
     } catch (error) {
         return {

[Survived] StringLiteral
src/services/travelApiService.js:88:26
             const { count, rows } = await db.Travels.findAndCountAll({
                 offset: offset,
                 limit: limit,
-                order: [["id", "DESC"]],
+                order: [["", "DESC"]],
                 include: [
                     { model: db.Tours }

[Timeout] ObjectLiteral
src/services/travelApiService.js:90:21
                 limit: limit,
                 order: [["id", "DESC"]],
                 include: [
-                    { model: db.Tours }
+                    {}
                 ]
             });

[Killed] BlockStatement
src/services/travelApiService.js:118:19
         let data = await db.Travels.findOne({
             where: { id: travelData.id }
         })
-        if (data) {
-            let res = await db.Travels.update({
-                startLocation: travelData.startLocation,
-                startDateTime: travelData.startDateTime,
-                maxTicket: travelData.maxTicket,
-                remainTicket: travelData.remainTicket,
-                travelPrice: travelData.travelPrice,
-                tourId: travelData.tourId,
-                discountId: travelData.discountId
-            }, {
-                where: {
-                    id: travelData.id
-                }
-            })
-            return {
-                EM: 'update package successfully',
-                EC: '0',
-                DT: '',
-            }
-        }
+        if (data) {}
         else {
             return {
killedBy: Travel API Service updateTravel should update a travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "update package successfully"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:119:47
             where: { id: travelData.id }
         })
         if (data) {
-            let res = await db.Travels.update({
-                startLocation: travelData.startLocation,
-                startDateTime: travelData.startDateTime,
-                maxTicket: travelData.maxTicket,
-                remainTicket: travelData.remainTicket,
-                travelPrice: travelData.travelPrice,
-                tourId: travelData.tourId,
-                discountId: travelData.discountId
-            }, {
+            let res = await db.Travels.update({}, {
                 where: {
                     id: travelData.id
killedBy: Travel API Service updateTravel should update a travel successfully
statusReason: AssertError: expected update to be called once and with exact arguments 
{} {
  startLocation: 'City A',
  startDateTime: 2024-01-02T19:55:01.314Z,
  maxTicket: 100,
  remainTicket: 50,
  travelPrice: 200.5,
  tourId: 123,

[Killed] BlockStatement
src/services/travelApiService.js:138:14
                 DT: '',
             }
         }
-        else {
-            return {
-                EM: 'not found data',
-                EC: '0',
-                DT: '',
-            }
-        }
+        else {}
     } catch (error) {
         return {
killedBy: Travel API Service updateTravel should handle non-existent travel during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found data"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:139:20
             }
         }
         else {
-            return {
-                EM: 'not found data',
-                EC: '0',
-                DT: '',
-            }
+            return {}
         }
     } catch (error) {
killedBy: Travel API Service updateTravel should handle non-existent travel during update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found data"}
Received:
  {}

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:146:16
             }
         }
     } catch (error) {
-        return {
-            EM: 'Database error',
-            EC: '1',
-            DT: '',
-        }
+        return {}
     }
 }
killedBy: Travel API Service updateTravel should handle error during travel update
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "Database error"}
Received:
  {}

Message:

[Killed] BlockStatement
src/services/travelApiService.js:154:9
     }
 }
 const deleteTravel = async (id) => {
-    try {
-        const travel = await db.Travels.findOne({ where: { id: id } });
-        if (travel) {
-            // Delete TRAVEL
-            await db.Travels.destroy({
-                where: { id: travel.id }
-            });
-
-            return {
-                EM: 'delete travel successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
-            return {
-                EM: 'not found travel',
-                EC: '0',
-                DT: ''
-            };
-        }
-    } catch (error) {
+    try {} catch (error) {
         return {
             EM: 'error deleting travel',
killedBy: Travel API Service deleteTravel should delete travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete travel successfully"}
Received:
  undefined

Message:

[Survived] ObjectLiteral
src/services/travelApiService.js:155:49
 }
 const deleteTravel = async (id) => {
     try {
-        const travel = await db.Travels.findOne({ where: { id: id } });
+        const travel = await db.Travels.findOne({});
         if (travel) {
             // Delete TRAVEL

[Killed] ConditionalExpression
src/services/travelApiService.js:156:13
 const deleteTravel = async (id) => {
     try {
         const travel = await db.Travels.findOne({ where: { id: id } });
-        if (travel) {
+        if (false) {
             // Delete TRAVEL
             await db.Travels.destroy({
killedBy: Travel API Service deleteTravel should delete travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete travel successfully"}
Received:
  {"DT": "", "EC": "0", "EM": "not found travel"}

Message:

[Killed] BlockStatement
src/services/travelApiService.js:156:21
 const deleteTravel = async (id) => {
     try {
         const travel = await db.Travels.findOne({ where: { id: id } });
-        if (travel) {
-            // Delete TRAVEL
-            await db.Travels.destroy({
-                where: { id: travel.id }
-            });
-
-            return {
-                EM: 'delete travel successfully',
-                EC: '0',
-                DT: ''
-            };
-        } else {
+        if (travel) {} else {
             return {
                 EM: 'not found travel',
killedBy: Travel API Service deleteTravel should delete travel successfully
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "delete travel successfully"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/travelApiService.js:167:16
                 EC: '0',
                 DT: ''
             };
-        } else {
-            return {
-                EM: 'not found travel',
-                EC: '0',
-                DT: ''
-            };
-        }
+        } else {}
     } catch (error) {
         return {
killedBy: Travel API Service deleteTravel should handle not found travel during deleteTravel
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "0", "EM": "not found travel"}
Received:
  undefined

Message:

[Killed] BlockStatement
src/services/travelApiService.js:174:21
                 DT: ''
             };
         }
-    } catch (error) {
-        return {
-            EM: 'error deleting travel',
-            EC: '1',
-            DT: ''
-        };
-    }
+    } catch (error) {}
 };
 
killedBy: Travel API Service deleteTravel should handle database error during deleteTravel
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting travel"}
Received:
  undefined

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:175:16
             };
         }
     } catch (error) {
-        return {
-            EM: 'error deleting travel',
-            EC: '1',
-            DT: ''
-        };
+        return {};
     }
 };
killedBy: Travel API Service deleteTravel should handle database error during deleteTravel
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting travel"}
Received:
  {}

Message:

[Killed] StringLiteral
src/services/travelApiService.js:176:17
         }
     } catch (error) {
         return {
-            EM: 'error deleting travel',
+            EM: "",
             EC: '1',
             DT: ''
killedBy: Travel API Service deleteTravel should handle database error during deleteTravel
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting travel"}
Received:
  {"DT": "", "EC": "1", "EM": ""}

Message:

[Killed] StringLiteral
src/services/travelApiService.js:177:17
     } catch (error) {
         return {
             EM: 'error deleting travel',
-            EC: '1',
+            EC: "",
             DT: ''
         };
killedBy: Travel API Service deleteTravel should handle database error during deleteTravel
statusReason: assert.deepStrictEqual(received, expected)

Expected value to deeply and strictly equal to:
  {"DT": "", "EC": "1", "EM": "error deleting travel"}
Received:
  {"DT": "", "EC": "", "EM": "error deleting travel"}

Message:

[Killed] ObjectLiteral
src/services/travelApiService.js:183:18
     }
 };
 
-module.exports = { createTravel, getTravelWithPagination, updateTravel, deleteTravel, getTravelById };
+module.exports = {};
killedBy: Travel API Service createTravel should create a travel successfully
statusReason: TypeError: createTravel is not a function
