[Killed] ConditionalExpression
src/controller/apiController.js:4:13
 import packageService from '../services/packageService';
 const getPackageList = async (req, res) => {
     try {
-        if (req.query.page != null) {
+        if (false) {
             const itemsPerPage = 10;
             let data = await packageService.getPackageList(req.query.page);
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Timeout] EqualityOperator
src/controller/apiController.js:4:13
 import packageService from '../services/packageService';
 const getPackageList = async (req, res) => {
     try {
-        if (req.query.page != null) {
+        if (req.query.page == null) {
             const itemsPerPage = 10;
             let data = await packageService.getPackageList(req.query.page);

[NoCoverage] ArithmeticOperator
src/controller/apiController.js:8:29
             const itemsPerPage = 10;
             let data = await packageService.getPackageList(req.query.page);
             let totalList = await packageService.getAllPackageList();
-            let totalPage = await totalList.length / itemsPerPage;
+            let totalPage = (await totalList.length) * itemsPerPage;
             if (totalPage < 1 && totalPage > 0) {
                 totalPage = 1;

[NoCoverage] EqualityOperator
src/controller/apiController.js:9:34
             let data = await packageService.getPackageList(req.query.page);
             let totalList = await packageService.getAllPackageList();
             let totalPage = await totalList.length / itemsPerPage;
-            if (totalPage < 1 && totalPage > 0) {
+            if (totalPage < 1 && totalPage >= 0) {
                 totalPage = 1;
             }

[NoCoverage] EqualityOperator
src/controller/apiController.js:9:17
             let data = await packageService.getPackageList(req.query.page);
             let totalList = await packageService.getAllPackageList();
             let totalPage = await totalList.length / itemsPerPage;
-            if (totalPage < 1 && totalPage > 0) {
+            if (totalPage >= 1 && totalPage > 0) {
                 totalPage = 1;
             }

[Timeout] BlockStatement
src/controller/apiController.js:19:14
                 TotalPage: totalPage,
             });
         }
-        else {
-            const itemsPerPage = 10;
-            let data = await packageService.getPackageList(1);
-            let totalList = await packageService.getAllPackageList();
-            let totalPage = await totalList.length / itemsPerPage;
-            if (totalPage < 1 && totalPage > 0) {
-                totalPage = 1;
-            }
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data,
-                TotalPage: totalPage,
-            });
-        }
+        else {}
     } catch (error) {
         console.log('Error caught:', error);

[Killed] EqualityOperator
src/controller/apiController.js:24:34
             let data = await packageService.getPackageList(1);
             let totalList = await packageService.getAllPackageList();
             let totalPage = await totalList.length / itemsPerPage;
-            if (totalPage < 1 && totalPage > 0) {
+            if (totalPage < 1 && totalPage <= 0) {
                 totalPage = 1;
             }
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ConditionalExpression
src/controller/apiController.js:24:17
             let data = await packageService.getPackageList(1);
             let totalList = await packageService.getAllPackageList();
             let totalPage = await totalList.length / itemsPerPage;
-            if (totalPage < 1 && totalPage > 0) {
+            if (true && totalPage > 0) {
                 totalPage = 1;
             }
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/controller/apiController.js:27:41
             if (totalPage < 1 && totalPage > 0) {
                 totalPage = 1;
             }
-            return res.status(200).json({
-                EM: data.EM,
-                EC: data.EC,
-                DT: data,
-                TotalPage: totalPage,
-            });
+            return res.status(200).json({});
         }
     } catch (error) {
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080
