[Timeout] BlockStatement
src/controller/homeController.js:2:44
 import packageService from '../services/packageService';
-const handleHomePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'home.ejs' });
-}
+const handleHomePage = async (req, res) => {}
 const handleTravelPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'travel.ejs' });

[Killed] StringLiteral
src/controller/homeController.js:3:48
 import packageService from '../services/packageService';
 const handleHomePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'home.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 const handleTravelPage = async (req, res) => {
killedBy: Server should start the server without errors
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/controller/homeController.js:6:48
     return res.render("layout.ejs", { content: 'home.ejs' });
 }
 const handleTravelPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'travel.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 const handleTourPage = async (req, res) => {
killedBy: Rendered Page should render travel pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/controller/homeController.js:6:37
     return res.render("layout.ejs", { content: 'home.ejs' });
 }
 const handleTravelPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'travel.ejs' });
+    return res.render("layout.ejs", {});
 }
 const handleTourPage = async (req, res) => {
killedBy: Rendered Page should render travel pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Timeout] BlockStatement
src/controller/homeController.js:11:47
 const handleTourPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'tour.ejs' });
 }
-const handlePackagePage = async (req, res) => {
-    let page = 1;
-    if (req.query.page == null) {
-        page = 1;
-    }
-    else {
-        page = req.query.page;
-    }
-    let packageList = await packageService.getPackageList(page);
-    let totalNumber = await packageService.getTotalNumber();
-    return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
-}
+const handlePackagePage = async (req, res) => {}
 const handleDiscountPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'discount.ejs' });

[Killed] ConditionalExpression
src/controller/homeController.js:13:9
 }
 const handlePackagePage = async (req, res) => {
     let page = 1;
-    if (req.query.page == null) {
+    if (false) {
         page = 1;
     }
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ConditionalExpression
src/controller/homeController.js:13:9
 }
 const handlePackagePage = async (req, res) => {
     let page = 1;
-    if (req.query.page == null) {
+    if (true) {
         page = 1;
     }
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[NoCoverage] BlockStatement
src/controller/homeController.js:16:10
     if (req.query.page == null) {
         page = 1;
     }
-    else {
-        page = req.query.page;
-    }
+    else {}
     let packageList = await packageService.getPackageList(page);
     let totalNumber = await packageService.getTotalNumber();

[Killed] StringLiteral
src/controller/homeController.js:21:23
     }
     let packageList = await packageService.getPackageList(page);
     let totalNumber = await packageService.getTotalNumber();
-    return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
+    return res.render("", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
 }
 const handleDiscountPage = async (req, res) => {
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Timeout] BlockStatement
src/controller/homeController.js:23:48
     let totalNumber = await packageService.getTotalNumber();
     return res.render("layout.ejs", { content: 'package.ejs', packageList: packageList, totalNumber: totalNumber });
 }
-const handleDiscountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'discount.ejs' });
-}
+const handleDiscountPage = async (req, res) => {}
 const handleAccountPage = async (req, res) => {
     return res.render("layout.ejs", { content: 'account.ejs' });

[Killed] StringLiteral
src/controller/homeController.js:27:48
     return res.render("layout.ejs", { content: 'discount.ejs' });
 }
 const handleAccountPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'account.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 const handleBookingPage = async (req, res) => {
killedBy: Rendered Page should render account pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ObjectLiteral
src/controller/homeController.js:30:37
     return res.render("layout.ejs", { content: 'account.ejs' });
 }
 const handleBookingPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'booking.ejs' });
+    return res.render("layout.ejs", {});
 }
 const handleInvoicePage = async (req, res) => {
killedBy: Rendered Page should render booking pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/controller/homeController.js:33:23
     return res.render("layout.ejs", { content: 'booking.ejs' });
 }
 const handleInvoicePage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'invoice.ejs' });
+    return res.render("", { content: 'invoice.ejs' });
 }
 const handleCustomerPage = async (req, res) => {
killedBy: Rendered Page should render invoice pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/controller/homeController.js:39:48
     return res.render("layout.ejs", { content: 'customer.ejs' });
 }
 const handleStatisticsPage = async (req, res) => {
-    return res.render("layout.ejs", { content: 'statistics.ejs' });
+    return res.render("layout.ejs", { content: "" });
 }
 module.exports = {
killedBy: Rendered Page should render statistics pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080
