[Killed] BlockStatement
src/services/packageService.js:2:39
 import db from '../models/index.js'
-const getAllPackageList = async () => {
-    try {
-        let packages = [];
-        packages = await db.Packages.findAll();
-        return packages;
-    } catch (error) {
-        console.log(error);
-    }
-}
+const getAllPackageList = async () => {}
 const getPackageList = async (page) => {
     try {
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/services/packageService.js:3:9
 import db from '../models/index.js'
 const getAllPackageList = async () => {
-    try {
-        let packages = [];
-        packages = await db.Packages.findAll();
-        return packages;
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
     }
killedBy: API Routes GET /api/package-data should return a list of packages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[NoCoverage] BlockStatement
src/services/packageService.js:7:21
         let packages = [];
         packages = await db.Packages.findAll();
         return packages;
-    } catch (error) {
-        console.log(error);
-    }
+    } catch (error) {}
 }
 const getPackageList = async (page) => {

[Killed] BlockStatement
src/services/packageService.js:11:40
         console.log(error);
     }
 }
-const getPackageList = async (page) => {
-    try {
-        let packages = [];
-        const itemsPerPage = 10;
-        const offset = (page - 1) * itemsPerPage;
-        packages = await db.Packages.findAll({
-            offset,
-            limit: itemsPerPage
-        });
-        return packages;
-    } catch (error) {
-        console.log(error);
-    }
-}
+const getPackageList = async (page) => {}
 const getTotalNumber = async () => {
     try {
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/services/packageService.js:12:9
     }
 }
 const getPackageList = async (page) => {
-    try {
-        let packages = [];
-        const itemsPerPage = 10;
-        const offset = (page - 1) * itemsPerPage;
-        packages = await db.Packages.findAll({
-            offset,
-            limit: itemsPerPage
-        });
-        return packages;
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
     }
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ArrayDeclaration
src/services/packageService.js:13:24
 }
 const getPackageList = async (page) => {
     try {
-        let packages = [];
+        let packages = ["Stryker was here"];
         const itemsPerPage = 10;
         const offset = (page - 1) * itemsPerPage;
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ArithmeticOperator
src/services/packageService.js:15:25
     try {
         let packages = [];
         const itemsPerPage = 10;
-        const offset = (page - 1) * itemsPerPage;
+        const offset = (page + 1) * itemsPerPage;
         packages = await db.Packages.findAll({
             offset,
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] ArithmeticOperator
src/services/packageService.js:15:24
     try {
         let packages = [];
         const itemsPerPage = 10;
-        const offset = (page - 1) * itemsPerPage;
+        const offset = (page - 1) / itemsPerPage;
         packages = await db.Packages.findAll({
             offset,
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/services/packageService.js:25:36
         console.log(error);
     }
 }
-const getTotalNumber = async () => {
-    try {
-        let totalNumber = 0;
-        totalNumber = await db.Packages.count();
-        return totalNumber;
-    } catch (error) {
-        console.log(error);
-    }
-}
+const getTotalNumber = async () => {}
 module.exports = {
     getPackageList, getTotalNumber, getAllPackageList
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] BlockStatement
src/services/packageService.js:26:9
     }
 }
 const getTotalNumber = async () => {
-    try {
-        let totalNumber = 0;
-        totalNumber = await db.Packages.count();
-        return totalNumber;
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
     }
killedBy: Rendered Page should render package pages
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[NoCoverage] BlockStatement
src/services/packageService.js:30:21
         let totalNumber = 0;
         totalNumber = await db.Packages.count();
         return totalNumber;
-    } catch (error) {
-        console.log(error);
-    }
+    } catch (error) {}
 }
 module.exports = {

[Timeout] ObjectLiteral
src/services/packageService.js:34:18
         console.log(error);
     }
 }
-module.exports = {
-    getPackageList, getTotalNumber, getAllPackageList
-}
+module.exports = {}
