[Killed] StringLiteral
src/server.js:20:17
 
 const PORT = 8080;
 app.listen(PORT, () => {
-    console.log(">>> Server is running at port ", PORT);
+    console.log("", PORT);
 })
 
killedBy: Server should start the server without errors
statusReason: Error: listen EADDRINUSE: address already in use :::8080
