[Killed] BlockStatement
src/routes/web.js:10:32
  * @param {*} app : express app
  */
 
-const initWebRoutes = (app) => {
-    router.get("/", homeController.handleHomePage);
-    router.get("/travel", homeController.handleTravelPage);
-    router.get("/tour", homeController.handleTourPage);
-    router.get("/package", homeController.handlePackagePage);
-    router.get("/discount", homeController.handleDiscountPage);
-    router.get("/account", homeController.handleAccountPage);
-    router.get("/booking", homeController.handleBookingPage);
-    router.get("/invoice", homeController.handleInvoicePage);
-    router.get("/customer", homeController.handleCustomerPage);
-    router.get("/statistics", homeController.handleStatisticsPage);
-    return app.use("/", router);
-}
+const initWebRoutes = (app) => {}
 
 export default initWebRoutes;
killedBy: Server should start the server without errors
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/routes/web.js:16:16
     router.get("/tour", homeController.handleTourPage);
     router.get("/package", homeController.handlePackagePage);
     router.get("/discount", homeController.handleDiscountPage);
-    router.get("/account", homeController.handleAccountPage);
+    router.get("", homeController.handleAccountPage);
     router.get("/booking", homeController.handleBookingPage);
     router.get("/invoice", homeController.handleInvoicePage);
killedBy: Server should start the server without errors
statusReason: Error: listen EADDRINUSE: address already in use :::8080

[Killed] StringLiteral
src/routes/web.js:18:16
     router.get("/discount", homeController.handleDiscountPage);
     router.get("/account", homeController.handleAccountPage);
     router.get("/booking", homeController.handleBookingPage);
-    router.get("/invoice", homeController.handleInvoicePage);
+    router.get("", homeController.handleInvoicePage);
     router.get("/customer", homeController.handleCustomerPage);
     router.get("/statistics", homeController.handleStatisticsPage);
killedBy: Server should start the server without errors
statusReason: Error: listen EADDRINUSE: address already in use :::8080
