[Timeout] BlockStatement
src/routes/api.js:10:32
  * @param {*} app : express app
  */
 
-const initApiRoutes = (app) => {
-    router.get("/package-data", apiController.getPackageList);
-
-    return app.use("/api", router);
-}
+const initApiRoutes = (app) => {}
 
 export default initApiRoutes;
